name: "SAN"
layer {
  name: "source_data"
  type: "ImageData"
  top: "source_data"
  top: "lp_labels"
  image_data_param {
    source: "./data/imagenet-caltech/imagenet_1000_list.txt"
    batch_size: 32
    shuffle: true
    new_height: 256
    new_width: 256
  }
  transform_param {
    crop_size: 227
    mean_file: "./data/ilsvrc12/imagenet_mean.binaryproto"
    mirror: true
  }
  include: { phase: TRAIN }
} 
layer {
  name: "target_data"
  type: "ImageData"
  top: "target_data"
  top: "target_labels"
  image_data_param {
    source: "./data/imagenet-caltech/caltech_84_list.txt"
    batch_size: 32
    shuffle: true
    new_height: 256
    new_width: 256
  }
  transform_param {
    crop_size: 227
    mean_file: "./data/ilsvrc12/imagenet_mean.binaryproto"
    mirror: true
  }
  include: { phase: TRAIN }
}
layer {
  name: "target_data"
  type: "ImageData"
  top: "data"
  top: "lp_labels"
  image_data_param {
    source: "./data/imagenet-caltech/caltech_84_list.txt"
    batch_size: 1
    shuffle: true
    new_height: 256
    new_width: 256
  }
  transform_param {
    crop_size: 227
    mean_file: "./data/ilsvrc12/imagenet_mean.binaryproto"
    mirror: true
  }
  include: { phase: TEST }
}
layer {
  name: "no_target_label"
  type: "Silence"
  bottom: "target_labels"
  include: { phase:TRAIN }
}
layer {
  name: "concat_data"
  type: "Concat"
  bottom: "source_data"
  bottom: "target_data"
  top: "data"
  concat_param {
    concat_dim: 0
  }
  include: { phase: TRAIN }
}

layer {
  name: "source_domain_labels"
  type: "DummyData"
  top: "source_domain_labels"
  dummy_data_param {
    data_filler {
      type: "constant"
      value: 0
    }
    num: 32
    channels: 1
    height: 1
    width: 1
  }
  include: { phase: TRAIN }
}
layer {
  name: "target_domain_labels"
  type: "DummyData"
  top: "target_domain_labels"
  dummy_data_param {
    data_filler {
      type: "constant"
      value: 1
    }
    num: 32
    channels: 1
    height: 1
    width: 1
  }
  include: { phase: TRAIN }
}
layer {
  name: "target_domain_labels"
  type: "DummyData"
  top: "dc_labels"
  dummy_data_param {
    data_filler {
      type: "constant"
      value: 1
    }
    num: 1
    channels: 1
    height: 1
    width: 1
  }
  include: { phase: TEST }
}
layer {
  name: "no_dc_label_in_test"
  type: "Silence"
  bottom: "dc_labels"
  include: { phase:TEST }
}
layer {
  name: "concat_domain_labels"
  type: "Concat"
  bottom: "source_domain_labels"
  bottom: "target_domain_labels"
  top: "dc_labels"
  concat_param {
    concat_dim: 0
  }
  include: { phase: TRAIN }
}

layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 11
    stride: 4
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu1"
  type: "ReLU"
  bottom: "conv1"
  top: "conv1"
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv1"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "norm1"
  type: "LRN"
  bottom: "pool1"
  top: "norm1"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layer {
  name: "conv2"
  type: "Convolution"
  bottom: "norm1"
  top: "conv2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 2
    kernel_size: 5
    group: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layer {
  name: "relu2"
  type: "ReLU"
  bottom: "conv2"
  top: "conv2"
}
layer {
  name: "pool2"
  type: "Pooling"
  bottom: "conv2"
  top: "pool2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "norm2"
  type: "LRN"
  bottom: "pool2"
  top: "norm2"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layer {
  name: "conv3"
  type: "Convolution"
  bottom: "norm2"
  top: "conv3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 384
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu3"
  type: "ReLU"
  bottom: "conv3"
  top: "conv3"
}
layer {
  name: "conv4"
  type: "Convolution"
  bottom: "conv3"
  top: "conv4"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 384
    pad: 1
    kernel_size: 3
    group: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layer {
  name: "relu4"
  type: "ReLU"
  bottom: "conv4"
  top: "conv4"
}
layer {
  name: "conv5"
  type: "Convolution"
  bottom: "conv4"
  top: "conv5"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    group: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layer {
  name: "relu5"
  type: "ReLU"
  bottom: "conv5"
  top: "conv5"
}
layer {
  name: "pool5"
  type: "Pooling"
  bottom: "conv5"
  top: "pool5"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "fc6"
  type: "InnerProduct"
  bottom: "pool5"
  top: "fc6"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layer {
  name: "relu6"
  type: "ReLU"
  bottom: "fc6"
  top: "fc6"
}
layer {
  name: "drop6"
  type: "Dropout"
  bottom: "fc6"
  top: "fc6"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "fc7"
  type: "InnerProduct"
  bottom: "fc6"
  top: "fc7"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layer {
  name: "relu7"
  type: "ReLU"
  bottom: "fc7"
  top: "fc7"
}
layer {
  name: "drop7"
  type: "Dropout"
  bottom: "fc7"
  top: "fc7"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "fc8"
  type: "InnerProduct"
  bottom: "fc7"
  top: "features_fc8"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1000
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "slice_features_fc7"
  type: "Slice"
  bottom: "features_fc8"
  top: "source_features_fc8"
  top: "target_features_fc8"
  slice_param {
    slice_dim: 0
  }
  include: { phase: TRAIN }
}
layer {
  name: "lp_accuracy"
  type: "Accuracy"
  bottom: "features_fc8"
  bottom: "lp_labels"
  top: "lp_accuracy"
  include: { phase: TEST }
}
layer {
  name: "lp_loss"
  type: "SoftmaxWithLoss"
  bottom: "source_features_fc8"
  bottom: "lp_labels"
  top: "lp_loss"
  include: { phase: TRAIN }
}
layer {
  name: "softmax_target_feature"
  type: "Softmax"
  bottom: "target_features_fc8"
  top: "target_features_fc8s"
  include: { phase: TRAIN }
  softmax_param{
    temperature: 1.0
  }
}
layer {
  name: "entropy_grl"
  type: "GradientScaler"
  bottom: "target_features_fc8s"
  top: "entropy_grl"
  gradient_scaler_param {
    lower_bound: 0.0
    upper_bound: 1.0
    alpha: 10.0
    max_iter: 3000
  }
  include: {phase: TRAIN}
}
layer {
  name: "entropy_loss"
  type: "EntropyLoss"
  bottom: "entropy_grl"
  #bottom: "target_labels"
  top: "entropy_loss"
  loss_weight: -1.0
  entropy_param {
    threshold: 0.001
    iter_threshold: 0
  }
  include: { phase: TRAIN }
}

layer {
  name: "softmax_feature"
  type: "Softmax"
  bottom: "features_fc8"
  top: "features_fc8s"
  softmax_param {
    temperature: 100.0
  }
  include: { phase: TRAIN }
}
layer {
  name: "grl"
  type: "GradientScaler"
  bottom: "fc7"
  top: "grl"
  gradient_scaler_param {
    lower_bound: 0.0
    upper_bound: 3.0
    alpha: 10.0
    max_iter: 10000
  }
  include: { phase: TRAIN }
}
layer {
  name: "slice_grl"
  type: "Split"
  bottom: "grl"
  top: "grl0"
  top: "grl1"
  top: "grl2"
  top: "grl3"
  top: "grl4"
  top: "grl5"
  top: "grl6"
  top: "grl7"
  top: "grl8"
  top: "grl9"
  top: "grl10"
  top: "grl11"
  top: "grl12"
  top: "grl13"
  top: "grl14"
  top: "grl15"
  top: "grl16"
  top: "grl17"
  top: "grl18"
  top: "grl19"
  top: "grl20"
  top: "grl21"
  top: "grl22"
  top: "grl23"
  top: "grl24"
  top: "grl25"
  top: "grl26"
  top: "grl27"
  top: "grl28"
  top: "grl29"
  top: "grl30"
  top: "grl31"
  top: "grl32"
  top: "grl33"
  top: "grl34"
  top: "grl35"
  top: "grl36"
  top: "grl37"
  top: "grl38"
  top: "grl39"
  top: "grl40"
  top: "grl41"
  top: "grl42"
  top: "grl43"
  top: "grl44"
  top: "grl45"
  top: "grl46"
  top: "grl47"
  top: "grl48"
  top: "grl49"
  top: "grl50"
  top: "grl51"
  top: "grl52"
  top: "grl53"
  top: "grl54"
  top: "grl55"
  top: "grl56"
  top: "grl57"
  top: "grl58"
  top: "grl59"
  top: "grl60"
  top: "grl61"
  top: "grl62"
  top: "grl63"
  top: "grl64"
  top: "grl65"
  top: "grl66"
  top: "grl67"
  top: "grl68"
  top: "grl69"
  top: "grl70"
  top: "grl71"
  top: "grl72"
  top: "grl73"
  top: "grl74"
  top: "grl75"
  top: "grl76"
  top: "grl77"
  top: "grl78"
  top: "grl79"
  top: "grl80"
  top: "grl81"
  top: "grl82"
  top: "grl83"
  top: "grl84"
  top: "grl85"
  top: "grl86"
  top: "grl87"
  top: "grl88"
  top: "grl89"
  top: "grl90"
  top: "grl91"
  top: "grl92"
  top: "grl93"
  top: "grl94"
  top: "grl95"
  top: "grl96"
  top: "grl97"
  top: "grl98"
  top: "grl99"
  top: "grl100"
  top: "grl101"
  top: "grl102"
  top: "grl103"
  top: "grl104"
  top: "grl105"
  top: "grl106"
  top: "grl107"
  top: "grl108"
  top: "grl109"
  top: "grl110"
  top: "grl111"
  top: "grl112"
  top: "grl113"
  top: "grl114"
  top: "grl115"
  top: "grl116"
  top: "grl117"
  top: "grl118"
  top: "grl119"
  top: "grl120"
  top: "grl121"
  top: "grl122"
  top: "grl123"
  top: "grl124"
  top: "grl125"
  top: "grl126"
  top: "grl127"
  top: "grl128"
  top: "grl129"
  top: "grl130"
  top: "grl131"
  top: "grl132"
  top: "grl133"
  top: "grl134"
  top: "grl135"
  top: "grl136"
  top: "grl137"
  top: "grl138"
  top: "grl139"
  top: "grl140"
  top: "grl141"
  top: "grl142"
  top: "grl143"
  top: "grl144"
  top: "grl145"
  top: "grl146"
  top: "grl147"
  top: "grl148"
  top: "grl149"
  top: "grl150"
  top: "grl151"
  top: "grl152"
  top: "grl153"
  top: "grl154"
  top: "grl155"
  top: "grl156"
  top: "grl157"
  top: "grl158"
  top: "grl159"
  top: "grl160"
  top: "grl161"
  top: "grl162"
  top: "grl163"
  top: "grl164"
  top: "grl165"
  top: "grl166"
  top: "grl167"
  top: "grl168"
  top: "grl169"
  top: "grl170"
  top: "grl171"
  top: "grl172"
  top: "grl173"
  top: "grl174"
  top: "grl175"
  top: "grl176"
  top: "grl177"
  top: "grl178"
  top: "grl179"
  top: "grl180"
  top: "grl181"
  top: "grl182"
  top: "grl183"
  top: "grl184"
  top: "grl185"
  top: "grl186"
  top: "grl187"
  top: "grl188"
  top: "grl189"
  top: "grl190"
  top: "grl191"
  top: "grl192"
  top: "grl193"
  top: "grl194"
  top: "grl195"
  top: "grl196"
  top: "grl197"
  top: "grl198"
  top: "grl199"
  top: "grl200"
  top: "grl201"
  top: "grl202"
  top: "grl203"
  top: "grl204"
  top: "grl205"
  top: "grl206"
  top: "grl207"
  top: "grl208"
  top: "grl209"
  top: "grl210"
  top: "grl211"
  top: "grl212"
  top: "grl213"
  top: "grl214"
  top: "grl215"
  top: "grl216"
  top: "grl217"
  top: "grl218"
  top: "grl219"
  top: "grl220"
  top: "grl221"
  top: "grl222"
  top: "grl223"
  top: "grl224"
  top: "grl225"
  top: "grl226"
  top: "grl227"
  top: "grl228"
  top: "grl229"
  top: "grl230"
  top: "grl231"
  top: "grl232"
  top: "grl233"
  top: "grl234"
  top: "grl235"
  top: "grl236"
  top: "grl237"
  top: "grl238"
  top: "grl239"
  top: "grl240"
  top: "grl241"
  top: "grl242"
  top: "grl243"
  top: "grl244"
  top: "grl245"
  top: "grl246"
  top: "grl247"
  top: "grl248"
  top: "grl249"
  top: "grl250"
  top: "grl251"
  top: "grl252"
  top: "grl253"
  top: "grl254"
  top: "grl255"
  top: "grl256"
  top: "grl257"
  top: "grl258"
  top: "grl259"
  top: "grl260"
  top: "grl261"
  top: "grl262"
  top: "grl263"
  top: "grl264"
  top: "grl265"
  top: "grl266"
  top: "grl267"
  top: "grl268"
  top: "grl269"
  top: "grl270"
  top: "grl271"
  top: "grl272"
  top: "grl273"
  top: "grl274"
  top: "grl275"
  top: "grl276"
  top: "grl277"
  top: "grl278"
  top: "grl279"
  top: "grl280"
  top: "grl281"
  top: "grl282"
  top: "grl283"
  top: "grl284"
  top: "grl285"
  top: "grl286"
  top: "grl287"
  top: "grl288"
  top: "grl289"
  top: "grl290"
  top: "grl291"
  top: "grl292"
  top: "grl293"
  top: "grl294"
  top: "grl295"
  top: "grl296"
  top: "grl297"
  top: "grl298"
  top: "grl299"
  top: "grl300"
  top: "grl301"
  top: "grl302"
  top: "grl303"
  top: "grl304"
  top: "grl305"
  top: "grl306"
  top: "grl307"
  top: "grl308"
  top: "grl309"
  top: "grl310"
  top: "grl311"
  top: "grl312"
  top: "grl313"
  top: "grl314"
  top: "grl315"
  top: "grl316"
  top: "grl317"
  top: "grl318"
  top: "grl319"
  top: "grl320"
  top: "grl321"
  top: "grl322"
  top: "grl323"
  top: "grl324"
  top: "grl325"
  top: "grl326"
  top: "grl327"
  top: "grl328"
  top: "grl329"
  top: "grl330"
  top: "grl331"
  top: "grl332"
  top: "grl333"
  top: "grl334"
  top: "grl335"
  top: "grl336"
  top: "grl337"
  top: "grl338"
  top: "grl339"
  top: "grl340"
  top: "grl341"
  top: "grl342"
  top: "grl343"
  top: "grl344"
  top: "grl345"
  top: "grl346"
  top: "grl347"
  top: "grl348"
  top: "grl349"
  top: "grl350"
  top: "grl351"
  top: "grl352"
  top: "grl353"
  top: "grl354"
  top: "grl355"
  top: "grl356"
  top: "grl357"
  top: "grl358"
  top: "grl359"
  top: "grl360"
  top: "grl361"
  top: "grl362"
  top: "grl363"
  top: "grl364"
  top: "grl365"
  top: "grl366"
  top: "grl367"
  top: "grl368"
  top: "grl369"
  top: "grl370"
  top: "grl371"
  top: "grl372"
  top: "grl373"
  top: "grl374"
  top: "grl375"
  top: "grl376"
  top: "grl377"
  top: "grl378"
  top: "grl379"
  top: "grl380"
  top: "grl381"
  top: "grl382"
  top: "grl383"
  top: "grl384"
  top: "grl385"
  top: "grl386"
  top: "grl387"
  top: "grl388"
  top: "grl389"
  top: "grl390"
  top: "grl391"
  top: "grl392"
  top: "grl393"
  top: "grl394"
  top: "grl395"
  top: "grl396"
  top: "grl397"
  top: "grl398"
  top: "grl399"
  top: "grl400"
  top: "grl401"
  top: "grl402"
  top: "grl403"
  top: "grl404"
  top: "grl405"
  top: "grl406"
  top: "grl407"
  top: "grl408"
  top: "grl409"
  top: "grl410"
  top: "grl411"
  top: "grl412"
  top: "grl413"
  top: "grl414"
  top: "grl415"
  top: "grl416"
  top: "grl417"
  top: "grl418"
  top: "grl419"
  top: "grl420"
  top: "grl421"
  top: "grl422"
  top: "grl423"
  top: "grl424"
  top: "grl425"
  top: "grl426"
  top: "grl427"
  top: "grl428"
  top: "grl429"
  top: "grl430"
  top: "grl431"
  top: "grl432"
  top: "grl433"
  top: "grl434"
  top: "grl435"
  top: "grl436"
  top: "grl437"
  top: "grl438"
  top: "grl439"
  top: "grl440"
  top: "grl441"
  top: "grl442"
  top: "grl443"
  top: "grl444"
  top: "grl445"
  top: "grl446"
  top: "grl447"
  top: "grl448"
  top: "grl449"
  top: "grl450"
  top: "grl451"
  top: "grl452"
  top: "grl453"
  top: "grl454"
  top: "grl455"
  top: "grl456"
  top: "grl457"
  top: "grl458"
  top: "grl459"
  top: "grl460"
  top: "grl461"
  top: "grl462"
  top: "grl463"
  top: "grl464"
  top: "grl465"
  top: "grl466"
  top: "grl467"
  top: "grl468"
  top: "grl469"
  top: "grl470"
  top: "grl471"
  top: "grl472"
  top: "grl473"
  top: "grl474"
  top: "grl475"
  top: "grl476"
  top: "grl477"
  top: "grl478"
  top: "grl479"
  top: "grl480"
  top: "grl481"
  top: "grl482"
  top: "grl483"
  top: "grl484"
  top: "grl485"
  top: "grl486"
  top: "grl487"
  top: "grl488"
  top: "grl489"
  top: "grl490"
  top: "grl491"
  top: "grl492"
  top: "grl493"
  top: "grl494"
  top: "grl495"
  top: "grl496"
  top: "grl497"
  top: "grl498"
  top: "grl499"
  top: "grl500"
  top: "grl501"
  top: "grl502"
  top: "grl503"
  top: "grl504"
  top: "grl505"
  top: "grl506"
  top: "grl507"
  top: "grl508"
  top: "grl509"
  top: "grl510"
  top: "grl511"
  top: "grl512"
  top: "grl513"
  top: "grl514"
  top: "grl515"
  top: "grl516"
  top: "grl517"
  top: "grl518"
  top: "grl519"
  top: "grl520"
  top: "grl521"
  top: "grl522"
  top: "grl523"
  top: "grl524"
  top: "grl525"
  top: "grl526"
  top: "grl527"
  top: "grl528"
  top: "grl529"
  top: "grl530"
  top: "grl531"
  top: "grl532"
  top: "grl533"
  top: "grl534"
  top: "grl535"
  top: "grl536"
  top: "grl537"
  top: "grl538"
  top: "grl539"
  top: "grl540"
  top: "grl541"
  top: "grl542"
  top: "grl543"
  top: "grl544"
  top: "grl545"
  top: "grl546"
  top: "grl547"
  top: "grl548"
  top: "grl549"
  top: "grl550"
  top: "grl551"
  top: "grl552"
  top: "grl553"
  top: "grl554"
  top: "grl555"
  top: "grl556"
  top: "grl557"
  top: "grl558"
  top: "grl559"
  top: "grl560"
  top: "grl561"
  top: "grl562"
  top: "grl563"
  top: "grl564"
  top: "grl565"
  top: "grl566"
  top: "grl567"
  top: "grl568"
  top: "grl569"
  top: "grl570"
  top: "grl571"
  top: "grl572"
  top: "grl573"
  top: "grl574"
  top: "grl575"
  top: "grl576"
  top: "grl577"
  top: "grl578"
  top: "grl579"
  top: "grl580"
  top: "grl581"
  top: "grl582"
  top: "grl583"
  top: "grl584"
  top: "grl585"
  top: "grl586"
  top: "grl587"
  top: "grl588"
  top: "grl589"
  top: "grl590"
  top: "grl591"
  top: "grl592"
  top: "grl593"
  top: "grl594"
  top: "grl595"
  top: "grl596"
  top: "grl597"
  top: "grl598"
  top: "grl599"
  top: "grl600"
  top: "grl601"
  top: "grl602"
  top: "grl603"
  top: "grl604"
  top: "grl605"
  top: "grl606"
  top: "grl607"
  top: "grl608"
  top: "grl609"
  top: "grl610"
  top: "grl611"
  top: "grl612"
  top: "grl613"
  top: "grl614"
  top: "grl615"
  top: "grl616"
  top: "grl617"
  top: "grl618"
  top: "grl619"
  top: "grl620"
  top: "grl621"
  top: "grl622"
  top: "grl623"
  top: "grl624"
  top: "grl625"
  top: "grl626"
  top: "grl627"
  top: "grl628"
  top: "grl629"
  top: "grl630"
  top: "grl631"
  top: "grl632"
  top: "grl633"
  top: "grl634"
  top: "grl635"
  top: "grl636"
  top: "grl637"
  top: "grl638"
  top: "grl639"
  top: "grl640"
  top: "grl641"
  top: "grl642"
  top: "grl643"
  top: "grl644"
  top: "grl645"
  top: "grl646"
  top: "grl647"
  top: "grl648"
  top: "grl649"
  top: "grl650"
  top: "grl651"
  top: "grl652"
  top: "grl653"
  top: "grl654"
  top: "grl655"
  top: "grl656"
  top: "grl657"
  top: "grl658"
  top: "grl659"
  top: "grl660"
  top: "grl661"
  top: "grl662"
  top: "grl663"
  top: "grl664"
  top: "grl665"
  top: "grl666"
  top: "grl667"
  top: "grl668"
  top: "grl669"
  top: "grl670"
  top: "grl671"
  top: "grl672"
  top: "grl673"
  top: "grl674"
  top: "grl675"
  top: "grl676"
  top: "grl677"
  top: "grl678"
  top: "grl679"
  top: "grl680"
  top: "grl681"
  top: "grl682"
  top: "grl683"
  top: "grl684"
  top: "grl685"
  top: "grl686"
  top: "grl687"
  top: "grl688"
  top: "grl689"
  top: "grl690"
  top: "grl691"
  top: "grl692"
  top: "grl693"
  top: "grl694"
  top: "grl695"
  top: "grl696"
  top: "grl697"
  top: "grl698"
  top: "grl699"
  top: "grl700"
  top: "grl701"
  top: "grl702"
  top: "grl703"
  top: "grl704"
  top: "grl705"
  top: "grl706"
  top: "grl707"
  top: "grl708"
  top: "grl709"
  top: "grl710"
  top: "grl711"
  top: "grl712"
  top: "grl713"
  top: "grl714"
  top: "grl715"
  top: "grl716"
  top: "grl717"
  top: "grl718"
  top: "grl719"
  top: "grl720"
  top: "grl721"
  top: "grl722"
  top: "grl723"
  top: "grl724"
  top: "grl725"
  top: "grl726"
  top: "grl727"
  top: "grl728"
  top: "grl729"
  top: "grl730"
  top: "grl731"
  top: "grl732"
  top: "grl733"
  top: "grl734"
  top: "grl735"
  top: "grl736"
  top: "grl737"
  top: "grl738"
  top: "grl739"
  top: "grl740"
  top: "grl741"
  top: "grl742"
  top: "grl743"
  top: "grl744"
  top: "grl745"
  top: "grl746"
  top: "grl747"
  top: "grl748"
  top: "grl749"
  top: "grl750"
  top: "grl751"
  top: "grl752"
  top: "grl753"
  top: "grl754"
  top: "grl755"
  top: "grl756"
  top: "grl757"
  top: "grl758"
  top: "grl759"
  top: "grl760"
  top: "grl761"
  top: "grl762"
  top: "grl763"
  top: "grl764"
  top: "grl765"
  top: "grl766"
  top: "grl767"
  top: "grl768"
  top: "grl769"
  top: "grl770"
  top: "grl771"
  top: "grl772"
  top: "grl773"
  top: "grl774"
  top: "grl775"
  top: "grl776"
  top: "grl777"
  top: "grl778"
  top: "grl779"
  top: "grl780"
  top: "grl781"
  top: "grl782"
  top: "grl783"
  top: "grl784"
  top: "grl785"
  top: "grl786"
  top: "grl787"
  top: "grl788"
  top: "grl789"
  top: "grl790"
  top: "grl791"
  top: "grl792"
  top: "grl793"
  top: "grl794"
  top: "grl795"
  top: "grl796"
  top: "grl797"
  top: "grl798"
  top: "grl799"
  top: "grl800"
  top: "grl801"
  top: "grl802"
  top: "grl803"
  top: "grl804"
  top: "grl805"
  top: "grl806"
  top: "grl807"
  top: "grl808"
  top: "grl809"
  top: "grl810"
  top: "grl811"
  top: "grl812"
  top: "grl813"
  top: "grl814"
  top: "grl815"
  top: "grl816"
  top: "grl817"
  top: "grl818"
  top: "grl819"
  top: "grl820"
  top: "grl821"
  top: "grl822"
  top: "grl823"
  top: "grl824"
  top: "grl825"
  top: "grl826"
  top: "grl827"
  top: "grl828"
  top: "grl829"
  top: "grl830"
  top: "grl831"
  top: "grl832"
  top: "grl833"
  top: "grl834"
  top: "grl835"
  top: "grl836"
  top: "grl837"
  top: "grl838"
  top: "grl839"
  top: "grl840"
  top: "grl841"
  top: "grl842"
  top: "grl843"
  top: "grl844"
  top: "grl845"
  top: "grl846"
  top: "grl847"
  top: "grl848"
  top: "grl849"
  top: "grl850"
  top: "grl851"
  top: "grl852"
  top: "grl853"
  top: "grl854"
  top: "grl855"
  top: "grl856"
  top: "grl857"
  top: "grl858"
  top: "grl859"
  top: "grl860"
  top: "grl861"
  top: "grl862"
  top: "grl863"
  top: "grl864"
  top: "grl865"
  top: "grl866"
  top: "grl867"
  top: "grl868"
  top: "grl869"
  top: "grl870"
  top: "grl871"
  top: "grl872"
  top: "grl873"
  top: "grl874"
  top: "grl875"
  top: "grl876"
  top: "grl877"
  top: "grl878"
  top: "grl879"
  top: "grl880"
  top: "grl881"
  top: "grl882"
  top: "grl883"
  top: "grl884"
  top: "grl885"
  top: "grl886"
  top: "grl887"
  top: "grl888"
  top: "grl889"
  top: "grl890"
  top: "grl891"
  top: "grl892"
  top: "grl893"
  top: "grl894"
  top: "grl895"
  top: "grl896"
  top: "grl897"
  top: "grl898"
  top: "grl899"
  top: "grl900"
  top: "grl901"
  top: "grl902"
  top: "grl903"
  top: "grl904"
  top: "grl905"
  top: "grl906"
  top: "grl907"
  top: "grl908"
  top: "grl909"
  top: "grl910"
  top: "grl911"
  top: "grl912"
  top: "grl913"
  top: "grl914"
  top: "grl915"
  top: "grl916"
  top: "grl917"
  top: "grl918"
  top: "grl919"
  top: "grl920"
  top: "grl921"
  top: "grl922"
  top: "grl923"
  top: "grl924"
  top: "grl925"
  top: "grl926"
  top: "grl927"
  top: "grl928"
  top: "grl929"
  top: "grl930"
  top: "grl931"
  top: "grl932"
  top: "grl933"
  top: "grl934"
  top: "grl935"
  top: "grl936"
  top: "grl937"
  top: "grl938"
  top: "grl939"
  top: "grl940"
  top: "grl941"
  top: "grl942"
  top: "grl943"
  top: "grl944"
  top: "grl945"
  top: "grl946"
  top: "grl947"
  top: "grl948"
  top: "grl949"
  top: "grl950"
  top: "grl951"
  top: "grl952"
  top: "grl953"
  top: "grl954"
  top: "grl955"
  top: "grl956"
  top: "grl957"
  top: "grl958"
  top: "grl959"
  top: "grl960"
  top: "grl961"
  top: "grl962"
  top: "grl963"
  top: "grl964"
  top: "grl965"
  top: "grl966"
  top: "grl967"
  top: "grl968"
  top: "grl969"
  top: "grl970"
  top: "grl971"
  top: "grl972"
  top: "grl973"
  top: "grl974"
  top: "grl975"
  top: "grl976"
  top: "grl977"
  top: "grl978"
  top: "grl979"
  top: "grl980"
  top: "grl981"
  top: "grl982"
  top: "grl983"
  top: "grl984"
  top: "grl985"
  top: "grl986"
  top: "grl987"
  top: "grl988"
  top: "grl989"
  top: "grl990"
  top: "grl991"
  top: "grl992"
  top: "grl993"
  top: "grl994"
  top: "grl995"
  top: "grl996"
  top: "grl997"
  top: "grl998"
  top: "grl999"
  #slice_param {
  #  slice_dim: 1
  #}
  include: { phase: TRAIN }
}

#caozhangjie modified
layer {
  name: "aggregate_weight"
  type: "AggregateWeight"
  bottom: "features_fc8s"
  top: "weight0"
  top: "weight1"
  top: "weight2"
  top: "weight3"
  top: "weight4"
  top: "weight5"
  top: "weight6"
  top: "weight7"
  top: "weight8"
  top: "weight9"
  top: "weight10"
  top: "weight11"
  top: "weight12"
  top: "weight13"
  top: "weight14"
  top: "weight15"
  top: "weight16"
  top: "weight17"
  top: "weight18"
  top: "weight19"
  top: "weight20"
  top: "weight21"
  top: "weight22"
  top: "weight23"
  top: "weight24"
  top: "weight25"
  top: "weight26"
  top: "weight27"
  top: "weight28"
  top: "weight29"
  top: "weight30"
  top: "weight31"
  top: "weight32"
  top: "weight33"
  top: "weight34"
  top: "weight35"
  top: "weight36"
  top: "weight37"
  top: "weight38"
  top: "weight39"
  top: "weight40"
  top: "weight41"
  top: "weight42"
  top: "weight43"
  top: "weight44"
  top: "weight45"
  top: "weight46"
  top: "weight47"
  top: "weight48"
  top: "weight49"
  top: "weight50"
  top: "weight51"
  top: "weight52"
  top: "weight53"
  top: "weight54"
  top: "weight55"
  top: "weight56"
  top: "weight57"
  top: "weight58"
  top: "weight59"
  top: "weight60"
  top: "weight61"
  top: "weight62"
  top: "weight63"
  top: "weight64"
  top: "weight65"
  top: "weight66"
  top: "weight67"
  top: "weight68"
  top: "weight69"
  top: "weight70"
  top: "weight71"
  top: "weight72"
  top: "weight73"
  top: "weight74"
  top: "weight75"
  top: "weight76"
  top: "weight77"
  top: "weight78"
  top: "weight79"
  top: "weight80"
  top: "weight81"
  top: "weight82"
  top: "weight83"
  top: "weight84"
  top: "weight85"
  top: "weight86"
  top: "weight87"
  top: "weight88"
  top: "weight89"
  top: "weight90"
  top: "weight91"
  top: "weight92"
  top: "weight93"
  top: "weight94"
  top: "weight95"
  top: "weight96"
  top: "weight97"
  top: "weight98"
  top: "weight99"
  top: "weight100"
  top: "weight101"
  top: "weight102"
  top: "weight103"
  top: "weight104"
  top: "weight105"
  top: "weight106"
  top: "weight107"
  top: "weight108"
  top: "weight109"
  top: "weight110"
  top: "weight111"
  top: "weight112"
  top: "weight113"
  top: "weight114"
  top: "weight115"
  top: "weight116"
  top: "weight117"
  top: "weight118"
  top: "weight119"
  top: "weight120"
  top: "weight121"
  top: "weight122"
  top: "weight123"
  top: "weight124"
  top: "weight125"
  top: "weight126"
  top: "weight127"
  top: "weight128"
  top: "weight129"
  top: "weight130"
  top: "weight131"
  top: "weight132"
  top: "weight133"
  top: "weight134"
  top: "weight135"
  top: "weight136"
  top: "weight137"
  top: "weight138"
  top: "weight139"
  top: "weight140"
  top: "weight141"
  top: "weight142"
  top: "weight143"
  top: "weight144"
  top: "weight145"
  top: "weight146"
  top: "weight147"
  top: "weight148"
  top: "weight149"
  top: "weight150"
  top: "weight151"
  top: "weight152"
  top: "weight153"
  top: "weight154"
  top: "weight155"
  top: "weight156"
  top: "weight157"
  top: "weight158"
  top: "weight159"
  top: "weight160"
  top: "weight161"
  top: "weight162"
  top: "weight163"
  top: "weight164"
  top: "weight165"
  top: "weight166"
  top: "weight167"
  top: "weight168"
  top: "weight169"
  top: "weight170"
  top: "weight171"
  top: "weight172"
  top: "weight173"
  top: "weight174"
  top: "weight175"
  top: "weight176"
  top: "weight177"
  top: "weight178"
  top: "weight179"
  top: "weight180"
  top: "weight181"
  top: "weight182"
  top: "weight183"
  top: "weight184"
  top: "weight185"
  top: "weight186"
  top: "weight187"
  top: "weight188"
  top: "weight189"
  top: "weight190"
  top: "weight191"
  top: "weight192"
  top: "weight193"
  top: "weight194"
  top: "weight195"
  top: "weight196"
  top: "weight197"
  top: "weight198"
  top: "weight199"
  top: "weight200"
  top: "weight201"
  top: "weight202"
  top: "weight203"
  top: "weight204"
  top: "weight205"
  top: "weight206"
  top: "weight207"
  top: "weight208"
  top: "weight209"
  top: "weight210"
  top: "weight211"
  top: "weight212"
  top: "weight213"
  top: "weight214"
  top: "weight215"
  top: "weight216"
  top: "weight217"
  top: "weight218"
  top: "weight219"
  top: "weight220"
  top: "weight221"
  top: "weight222"
  top: "weight223"
  top: "weight224"
  top: "weight225"
  top: "weight226"
  top: "weight227"
  top: "weight228"
  top: "weight229"
  top: "weight230"
  top: "weight231"
  top: "weight232"
  top: "weight233"
  top: "weight234"
  top: "weight235"
  top: "weight236"
  top: "weight237"
  top: "weight238"
  top: "weight239"
  top: "weight240"
  top: "weight241"
  top: "weight242"
  top: "weight243"
  top: "weight244"
  top: "weight245"
  top: "weight246"
  top: "weight247"
  top: "weight248"
  top: "weight249"
  top: "weight250"
  top: "weight251"
  top: "weight252"
  top: "weight253"
  top: "weight254"
  top: "weight255"
  top: "weight256"
  top: "weight257"
  top: "weight258"
  top: "weight259"
  top: "weight260"
  top: "weight261"
  top: "weight262"
  top: "weight263"
  top: "weight264"
  top: "weight265"
  top: "weight266"
  top: "weight267"
  top: "weight268"
  top: "weight269"
  top: "weight270"
  top: "weight271"
  top: "weight272"
  top: "weight273"
  top: "weight274"
  top: "weight275"
  top: "weight276"
  top: "weight277"
  top: "weight278"
  top: "weight279"
  top: "weight280"
  top: "weight281"
  top: "weight282"
  top: "weight283"
  top: "weight284"
  top: "weight285"
  top: "weight286"
  top: "weight287"
  top: "weight288"
  top: "weight289"
  top: "weight290"
  top: "weight291"
  top: "weight292"
  top: "weight293"
  top: "weight294"
  top: "weight295"
  top: "weight296"
  top: "weight297"
  top: "weight298"
  top: "weight299"
  top: "weight300"
  top: "weight301"
  top: "weight302"
  top: "weight303"
  top: "weight304"
  top: "weight305"
  top: "weight306"
  top: "weight307"
  top: "weight308"
  top: "weight309"
  top: "weight310"
  top: "weight311"
  top: "weight312"
  top: "weight313"
  top: "weight314"
  top: "weight315"
  top: "weight316"
  top: "weight317"
  top: "weight318"
  top: "weight319"
  top: "weight320"
  top: "weight321"
  top: "weight322"
  top: "weight323"
  top: "weight324"
  top: "weight325"
  top: "weight326"
  top: "weight327"
  top: "weight328"
  top: "weight329"
  top: "weight330"
  top: "weight331"
  top: "weight332"
  top: "weight333"
  top: "weight334"
  top: "weight335"
  top: "weight336"
  top: "weight337"
  top: "weight338"
  top: "weight339"
  top: "weight340"
  top: "weight341"
  top: "weight342"
  top: "weight343"
  top: "weight344"
  top: "weight345"
  top: "weight346"
  top: "weight347"
  top: "weight348"
  top: "weight349"
  top: "weight350"
  top: "weight351"
  top: "weight352"
  top: "weight353"
  top: "weight354"
  top: "weight355"
  top: "weight356"
  top: "weight357"
  top: "weight358"
  top: "weight359"
  top: "weight360"
  top: "weight361"
  top: "weight362"
  top: "weight363"
  top: "weight364"
  top: "weight365"
  top: "weight366"
  top: "weight367"
  top: "weight368"
  top: "weight369"
  top: "weight370"
  top: "weight371"
  top: "weight372"
  top: "weight373"
  top: "weight374"
  top: "weight375"
  top: "weight376"
  top: "weight377"
  top: "weight378"
  top: "weight379"
  top: "weight380"
  top: "weight381"
  top: "weight382"
  top: "weight383"
  top: "weight384"
  top: "weight385"
  top: "weight386"
  top: "weight387"
  top: "weight388"
  top: "weight389"
  top: "weight390"
  top: "weight391"
  top: "weight392"
  top: "weight393"
  top: "weight394"
  top: "weight395"
  top: "weight396"
  top: "weight397"
  top: "weight398"
  top: "weight399"
  top: "weight400"
  top: "weight401"
  top: "weight402"
  top: "weight403"
  top: "weight404"
  top: "weight405"
  top: "weight406"
  top: "weight407"
  top: "weight408"
  top: "weight409"
  top: "weight410"
  top: "weight411"
  top: "weight412"
  top: "weight413"
  top: "weight414"
  top: "weight415"
  top: "weight416"
  top: "weight417"
  top: "weight418"
  top: "weight419"
  top: "weight420"
  top: "weight421"
  top: "weight422"
  top: "weight423"
  top: "weight424"
  top: "weight425"
  top: "weight426"
  top: "weight427"
  top: "weight428"
  top: "weight429"
  top: "weight430"
  top: "weight431"
  top: "weight432"
  top: "weight433"
  top: "weight434"
  top: "weight435"
  top: "weight436"
  top: "weight437"
  top: "weight438"
  top: "weight439"
  top: "weight440"
  top: "weight441"
  top: "weight442"
  top: "weight443"
  top: "weight444"
  top: "weight445"
  top: "weight446"
  top: "weight447"
  top: "weight448"
  top: "weight449"
  top: "weight450"
  top: "weight451"
  top: "weight452"
  top: "weight453"
  top: "weight454"
  top: "weight455"
  top: "weight456"
  top: "weight457"
  top: "weight458"
  top: "weight459"
  top: "weight460"
  top: "weight461"
  top: "weight462"
  top: "weight463"
  top: "weight464"
  top: "weight465"
  top: "weight466"
  top: "weight467"
  top: "weight468"
  top: "weight469"
  top: "weight470"
  top: "weight471"
  top: "weight472"
  top: "weight473"
  top: "weight474"
  top: "weight475"
  top: "weight476"
  top: "weight477"
  top: "weight478"
  top: "weight479"
  top: "weight480"
  top: "weight481"
  top: "weight482"
  top: "weight483"
  top: "weight484"
  top: "weight485"
  top: "weight486"
  top: "weight487"
  top: "weight488"
  top: "weight489"
  top: "weight490"
  top: "weight491"
  top: "weight492"
  top: "weight493"
  top: "weight494"
  top: "weight495"
  top: "weight496"
  top: "weight497"
  top: "weight498"
  top: "weight499"
  top: "weight500"
  top: "weight501"
  top: "weight502"
  top: "weight503"
  top: "weight504"
  top: "weight505"
  top: "weight506"
  top: "weight507"
  top: "weight508"
  top: "weight509"
  top: "weight510"
  top: "weight511"
  top: "weight512"
  top: "weight513"
  top: "weight514"
  top: "weight515"
  top: "weight516"
  top: "weight517"
  top: "weight518"
  top: "weight519"
  top: "weight520"
  top: "weight521"
  top: "weight522"
  top: "weight523"
  top: "weight524"
  top: "weight525"
  top: "weight526"
  top: "weight527"
  top: "weight528"
  top: "weight529"
  top: "weight530"
  top: "weight531"
  top: "weight532"
  top: "weight533"
  top: "weight534"
  top: "weight535"
  top: "weight536"
  top: "weight537"
  top: "weight538"
  top: "weight539"
  top: "weight540"
  top: "weight541"
  top: "weight542"
  top: "weight543"
  top: "weight544"
  top: "weight545"
  top: "weight546"
  top: "weight547"
  top: "weight548"
  top: "weight549"
  top: "weight550"
  top: "weight551"
  top: "weight552"
  top: "weight553"
  top: "weight554"
  top: "weight555"
  top: "weight556"
  top: "weight557"
  top: "weight558"
  top: "weight559"
  top: "weight560"
  top: "weight561"
  top: "weight562"
  top: "weight563"
  top: "weight564"
  top: "weight565"
  top: "weight566"
  top: "weight567"
  top: "weight568"
  top: "weight569"
  top: "weight570"
  top: "weight571"
  top: "weight572"
  top: "weight573"
  top: "weight574"
  top: "weight575"
  top: "weight576"
  top: "weight577"
  top: "weight578"
  top: "weight579"
  top: "weight580"
  top: "weight581"
  top: "weight582"
  top: "weight583"
  top: "weight584"
  top: "weight585"
  top: "weight586"
  top: "weight587"
  top: "weight588"
  top: "weight589"
  top: "weight590"
  top: "weight591"
  top: "weight592"
  top: "weight593"
  top: "weight594"
  top: "weight595"
  top: "weight596"
  top: "weight597"
  top: "weight598"
  top: "weight599"
  top: "weight600"
  top: "weight601"
  top: "weight602"
  top: "weight603"
  top: "weight604"
  top: "weight605"
  top: "weight606"
  top: "weight607"
  top: "weight608"
  top: "weight609"
  top: "weight610"
  top: "weight611"
  top: "weight612"
  top: "weight613"
  top: "weight614"
  top: "weight615"
  top: "weight616"
  top: "weight617"
  top: "weight618"
  top: "weight619"
  top: "weight620"
  top: "weight621"
  top: "weight622"
  top: "weight623"
  top: "weight624"
  top: "weight625"
  top: "weight626"
  top: "weight627"
  top: "weight628"
  top: "weight629"
  top: "weight630"
  top: "weight631"
  top: "weight632"
  top: "weight633"
  top: "weight634"
  top: "weight635"
  top: "weight636"
  top: "weight637"
  top: "weight638"
  top: "weight639"
  top: "weight640"
  top: "weight641"
  top: "weight642"
  top: "weight643"
  top: "weight644"
  top: "weight645"
  top: "weight646"
  top: "weight647"
  top: "weight648"
  top: "weight649"
  top: "weight650"
  top: "weight651"
  top: "weight652"
  top: "weight653"
  top: "weight654"
  top: "weight655"
  top: "weight656"
  top: "weight657"
  top: "weight658"
  top: "weight659"
  top: "weight660"
  top: "weight661"
  top: "weight662"
  top: "weight663"
  top: "weight664"
  top: "weight665"
  top: "weight666"
  top: "weight667"
  top: "weight668"
  top: "weight669"
  top: "weight670"
  top: "weight671"
  top: "weight672"
  top: "weight673"
  top: "weight674"
  top: "weight675"
  top: "weight676"
  top: "weight677"
  top: "weight678"
  top: "weight679"
  top: "weight680"
  top: "weight681"
  top: "weight682"
  top: "weight683"
  top: "weight684"
  top: "weight685"
  top: "weight686"
  top: "weight687"
  top: "weight688"
  top: "weight689"
  top: "weight690"
  top: "weight691"
  top: "weight692"
  top: "weight693"
  top: "weight694"
  top: "weight695"
  top: "weight696"
  top: "weight697"
  top: "weight698"
  top: "weight699"
  top: "weight700"
  top: "weight701"
  top: "weight702"
  top: "weight703"
  top: "weight704"
  top: "weight705"
  top: "weight706"
  top: "weight707"
  top: "weight708"
  top: "weight709"
  top: "weight710"
  top: "weight711"
  top: "weight712"
  top: "weight713"
  top: "weight714"
  top: "weight715"
  top: "weight716"
  top: "weight717"
  top: "weight718"
  top: "weight719"
  top: "weight720"
  top: "weight721"
  top: "weight722"
  top: "weight723"
  top: "weight724"
  top: "weight725"
  top: "weight726"
  top: "weight727"
  top: "weight728"
  top: "weight729"
  top: "weight730"
  top: "weight731"
  top: "weight732"
  top: "weight733"
  top: "weight734"
  top: "weight735"
  top: "weight736"
  top: "weight737"
  top: "weight738"
  top: "weight739"
  top: "weight740"
  top: "weight741"
  top: "weight742"
  top: "weight743"
  top: "weight744"
  top: "weight745"
  top: "weight746"
  top: "weight747"
  top: "weight748"
  top: "weight749"
  top: "weight750"
  top: "weight751"
  top: "weight752"
  top: "weight753"
  top: "weight754"
  top: "weight755"
  top: "weight756"
  top: "weight757"
  top: "weight758"
  top: "weight759"
  top: "weight760"
  top: "weight761"
  top: "weight762"
  top: "weight763"
  top: "weight764"
  top: "weight765"
  top: "weight766"
  top: "weight767"
  top: "weight768"
  top: "weight769"
  top: "weight770"
  top: "weight771"
  top: "weight772"
  top: "weight773"
  top: "weight774"
  top: "weight775"
  top: "weight776"
  top: "weight777"
  top: "weight778"
  top: "weight779"
  top: "weight780"
  top: "weight781"
  top: "weight782"
  top: "weight783"
  top: "weight784"
  top: "weight785"
  top: "weight786"
  top: "weight787"
  top: "weight788"
  top: "weight789"
  top: "weight790"
  top: "weight791"
  top: "weight792"
  top: "weight793"
  top: "weight794"
  top: "weight795"
  top: "weight796"
  top: "weight797"
  top: "weight798"
  top: "weight799"
  top: "weight800"
  top: "weight801"
  top: "weight802"
  top: "weight803"
  top: "weight804"
  top: "weight805"
  top: "weight806"
  top: "weight807"
  top: "weight808"
  top: "weight809"
  top: "weight810"
  top: "weight811"
  top: "weight812"
  top: "weight813"
  top: "weight814"
  top: "weight815"
  top: "weight816"
  top: "weight817"
  top: "weight818"
  top: "weight819"
  top: "weight820"
  top: "weight821"
  top: "weight822"
  top: "weight823"
  top: "weight824"
  top: "weight825"
  top: "weight826"
  top: "weight827"
  top: "weight828"
  top: "weight829"
  top: "weight830"
  top: "weight831"
  top: "weight832"
  top: "weight833"
  top: "weight834"
  top: "weight835"
  top: "weight836"
  top: "weight837"
  top: "weight838"
  top: "weight839"
  top: "weight840"
  top: "weight841"
  top: "weight842"
  top: "weight843"
  top: "weight844"
  top: "weight845"
  top: "weight846"
  top: "weight847"
  top: "weight848"
  top: "weight849"
  top: "weight850"
  top: "weight851"
  top: "weight852"
  top: "weight853"
  top: "weight854"
  top: "weight855"
  top: "weight856"
  top: "weight857"
  top: "weight858"
  top: "weight859"
  top: "weight860"
  top: "weight861"
  top: "weight862"
  top: "weight863"
  top: "weight864"
  top: "weight865"
  top: "weight866"
  top: "weight867"
  top: "weight868"
  top: "weight869"
  top: "weight870"
  top: "weight871"
  top: "weight872"
  top: "weight873"
  top: "weight874"
  top: "weight875"
  top: "weight876"
  top: "weight877"
  top: "weight878"
  top: "weight879"
  top: "weight880"
  top: "weight881"
  top: "weight882"
  top: "weight883"
  top: "weight884"
  top: "weight885"
  top: "weight886"
  top: "weight887"
  top: "weight888"
  top: "weight889"
  top: "weight890"
  top: "weight891"
  top: "weight892"
  top: "weight893"
  top: "weight894"
  top: "weight895"
  top: "weight896"
  top: "weight897"
  top: "weight898"
  top: "weight899"
  top: "weight900"
  top: "weight901"
  top: "weight902"
  top: "weight903"
  top: "weight904"
  top: "weight905"
  top: "weight906"
  top: "weight907"
  top: "weight908"
  top: "weight909"
  top: "weight910"
  top: "weight911"
  top: "weight912"
  top: "weight913"
  top: "weight914"
  top: "weight915"
  top: "weight916"
  top: "weight917"
  top: "weight918"
  top: "weight919"
  top: "weight920"
  top: "weight921"
  top: "weight922"
  top: "weight923"
  top: "weight924"
  top: "weight925"
  top: "weight926"
  top: "weight927"
  top: "weight928"
  top: "weight929"
  top: "weight930"
  top: "weight931"
  top: "weight932"
  top: "weight933"
  top: "weight934"
  top: "weight935"
  top: "weight936"
  top: "weight937"
  top: "weight938"
  top: "weight939"
  top: "weight940"
  top: "weight941"
  top: "weight942"
  top: "weight943"
  top: "weight944"
  top: "weight945"
  top: "weight946"
  top: "weight947"
  top: "weight948"
  top: "weight949"
  top: "weight950"
  top: "weight951"
  top: "weight952"
  top: "weight953"
  top: "weight954"
  top: "weight955"
  top: "weight956"
  top: "weight957"
  top: "weight958"
  top: "weight959"
  top: "weight960"
  top: "weight961"
  top: "weight962"
  top: "weight963"
  top: "weight964"
  top: "weight965"
  top: "weight966"
  top: "weight967"
  top: "weight968"
  top: "weight969"
  top: "weight970"
  top: "weight971"
  top: "weight972"
  top: "weight973"
  top: "weight974"
  top: "weight975"
  top: "weight976"
  top: "weight977"
  top: "weight978"
  top: "weight979"
  top: "weight980"
  top: "weight981"
  top: "weight982"
  top: "weight983"
  top: "weight984"
  top: "weight985"
  top: "weight986"
  top: "weight987"
  top: "weight988"
  top: "weight989"
  top: "weight990"
  top: "weight991"
  top: "weight992"
  top: "weight993"
  top: "weight994"
  top: "weight995"
  top: "weight996"
  top: "weight997"
  top: "weight998"
  top: "weight999"
  include: { phase: TRAIN }
}

layer {
  name: "dc_ip10"
  type: "InnerProduct"
  bottom: "grl0"
  top: "dc_ip10"
  param {
    #name: "ip1_1"
    lr_mult: 10
  }
  param {
    #name: "ip1_2"
    lr_mult: 20
  }
  inner_product_param {
    num_output: 128
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
  include: { phase: TRAIN }
}
layer {
  name: "dc_relu10"
  type: "ReLU"
  bottom: "dc_ip10"
  top: "dc_ip10"
  include: { phase: TRAIN }
}
layer {
  name: "dc_drop10"
  type: "Dropout"
  bottom: "dc_ip10"
  top: "dc_ip10"
  dropout_param {
    dropout_ratio: 0.5
  }
  include: { phase: TRAIN }
}
#layer {
#  name: "dc_ip20"
#  type: "InnerProduct"
#  bottom: "dc_ip10"
#  top: "dc_ip20"
#  param {
#    #name: "ip2_1"
#    lr_mult: 10
#  }
#  param {
#    #name: "ip2_2"
#    lr_mult: 20
#  }
#  inner_product_param {
#    num_output: 1024
#    weight_filler {
#      type: "gaussian"
#      std: 0.01
#    }
#    bias_filler {
#      type: "constant"
#    }
#  }
#  include: { phase: TRAIN }
#}
#layer {
#  name: "dc_relu20"
#  type: "ReLU"
#  bottom: "dc_ip20"
#  top: "dc_ip20"
#  include: { phase: TRAIN }
#}
#layer {
#  name: "dc_drop20"
#  type: "Dropout"
#  bottom: "dc_ip20"
#  top: "dc_ip20"
#  dropout_param {
#    dropout_ratio: 0.5
#  }
#  include: { phase: TRAIN }
#}
layer {
  name: "dc_ip30"
  type: "InnerProduct"
  bottom: "dc_ip10"
  top: "dc_ip30"
  param {
    lr_mult: 10
  }
  param {
    lr_mult: 20
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.3
    }
    bias_filler {
      type: "constant"
    }
  }
  include: { phase: TRAIN }
}
layer {
  name: "dc_loss0"
  type: "SigmoidCrossEntropyLoss"
  bottom: "dc_ip30"
  bottom: "dc_labels"
  bottom: "weight0"
  top: "dc_loss0"
  loss_weight: 0.1
  include: { phase: TRAIN }
}
layer {
  name: "dc_ip11"
  type: "InnerProduct"
  bottom: "grl1"
  top: "dc_ip11"
  param {
    #name: "ip1_1"
    lr_mult: 10
  }
  param {
    #name: "ip1_2"
    lr_mult: 20
  }
  inner_product_param {
    num_output: 128
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
  include: { phase: TRAIN }
}
layer {
  name: "dc_relu11"
  type: "ReLU"
  bottom: "dc_ip11"
  top: "dc_ip11"
  include: { phase: TRAIN }
}
layer {
  name: "dc_drop11"
  type: "Dropout"
  bottom: "dc_ip11"
  top: "dc_ip11"
  dropout_param {
    dropout_ratio: 0.5
  }
  include: { phase: TRAIN }
}
#layer {
#  name: "dc_ip21"
#  type: "InnerProduct"
#  bottom: "dc_ip11"
#  top: "dc_ip21"
#  param {
#    #name: "ip2_1"
#    lr_mult: 10
#  }
#  param {
#    #name: "ip2_2"
#    lr_mult: 20
#  }
#  inner_product_param {
#    num_output: 1024
#    weight_filler {
#      type: "gaussian"
#      std: 0.01
#    }
#    bias_filler {
#      type: "constant"
#    }
#  }
#  include: { phase: TRAIN }
#}
#layer {
#  name: "dc_relu21"
#  type: "ReLU"
#  bottom: "dc_ip21"
#  top: "dc_ip21"
#  include: { phase: TRAIN }
#}
#layer {
#  name: "dc_drop21"
#  type: "Dropout"
#  bottom: "dc_ip21"
#  top: "dc_ip21"
#  dropout_param {
#    dropout_ratio: 0.5
#  }
#  include: { phase: TRAIN }
#}
layer {
  name: "dc_ip31"
  type: "InnerProduct"
  bottom: "dc_ip11"
  top: "dc_ip31"
  param {
    lr_mult: 10
  }
  param {
    lr_mult: 20
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.3
    }
    bias_filler {
      type: "constant"
    }
  }
  include: { phase: TRAIN }
}
layer {
  name: "dc_loss1"
  type: "SigmoidCrossEntropyLoss"
  bottom: "dc_ip31"
  bottom: "dc_labels"
  bottom: "weight1"
  top: "dc_loss1"
  loss_weight: 0.1
  include: { phase: TRAIN }
}
layer {
  name: "dc_ip12"
  type: "InnerProduct"
  bottom: "grl2"
  top: "dc_ip12"
  param {
    #name: "ip1_1"
    lr_mult: 10
  }
  param {
    #name: "ip1_2"
    lr_mult: 20
  }
  inner_product_param {
    num_output: 128
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
  include: { phase: TRAIN }
}
layer {
  name: "dc_relu12"
  type: "ReLU"
  bottom: "dc_ip12"
  top: "dc_ip12"
  include: { phase: TRAIN }
}
layer {
  name: "dc_drop12"
  type: "Dropout"
  bottom: "dc_ip12"
  top: "dc_ip12"
  dropout_param {
    dropout_ratio: 0.5
  }
  include: { phase: TRAIN }
}
#layer {
#  name: "dc_ip22"
#  type: "InnerProduct"
#  bottom: "dc_ip12"
#  top: "dc_ip22"
#  param {
#    #name: "ip2_1"
#    lr_mult: 10
#  }
#  param {
#    #name: "ip2_2"
#    lr_mult: 20
#  }
#  inner_product_param {
#    num_output: 1024
#    weight_filler {
#      type: "gaussian"
#      std: 0.01
#    }
#    bias_filler {
#      type: "constant"
#    }
#  }
#  include: { phase: TRAIN }
#}
#layer {
#  name: "dc_relu22"
#  type: "ReLU"
#  bottom: "dc_ip22"
#  top: "dc_ip22"
#  include: { phase: TRAIN }
#}
#layer {
#  name: "dc_drop22"
#  type: "Dropout"
#  bottom: "dc_ip22"
#  top: "dc_ip22"
#  dropout_param {
#    dropout_ratio: 0.5
#  }
#  include: { phase: TRAIN }
#}
layer {
  name: "dc_ip32"
  type: "InnerProduct"
  bottom: "dc_ip12"
  top: "dc_ip32"
  param {
    lr_mult: 10
  }
  param {
    lr_mult: 20
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.3
    }
    bias_filler {
      type: "constant"
    }
  }
  include: { phase: TRAIN }
}
layer {
  name: "dc_loss2"
  type: "SigmoidCrossEntropyLoss"
  bottom: "dc_ip32"
  bottom: "dc_labels"
  bottom: "weight2"
  top: "dc_loss2"
  loss_weight: 0.1
  include: { phase: TRAIN }
}
layer {
  name: "dc_ip13"
  type: "InnerProduct"
  bottom: "grl3"
  top: "dc_ip13"
  param {
    #name: "ip1_1"
    lr_mult: 10
  }
  param {
    #name: "ip1_2"
    lr_mult: 20
  }
  inner_product_param {
    num_output: 128
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
  include: { phase: TRAIN }
}
layer {
  name: "dc_relu13"
  type: "ReLU"
  bottom: "dc_ip13"
  top: "dc_ip13"
  include: { phase: TRAIN }
}
layer {
  name: "dc_drop13"
  type: "Dropout"
  bottom: "dc_ip13"
  top: "dc_ip13"
  dropout_param {
    dropout_ratio: 0.5
  }
  include: { phase: TRAIN }
}
#layer {
#  name: "dc_ip23"
#  type: "InnerProduct"
#  bottom: "dc_ip13"
#  top: "dc_ip23"
#  param {
#    #name: "ip2_1"
#    lr_mult: 10
#  }
#  param {
