name: "SAN"
layer {
  name: "source_data"
  type: "ImageData"
  top: "source_data"
  top: "lp_labels"
  image_data_param {
    source: "./data/caltech-office/caltech_256_list.txt"
    batch_size: 64
    shuffle: true
    new_height: 256
    new_width: 256
  }
  transform_param {
    crop_size: 227
    mean_file: "./data/ilsvrc12/imagenet_mean.binaryproto"
    mirror: true
  }
  include: { phase: TRAIN }
} 
layer {
  name: "source_domain_labels"
  type: "DummyData"
  top: "source_domain_labels"
  dummy_data_param {
    data_filler {
      type: "constant"
      value: 0
    }
    num: 64
    channels: 1
    height: 1
    width: 1
  }
  include: { phase: TRAIN }
}
layer {
  name: "target_data"
  type: "ImageData"
  top: "target_data"
  top: "target_labels"
  image_data_param {
    source: "./data/caltech-office/webcam_10_list.txt"
    batch_size: 64
    shuffle: true
    new_height: 256
    new_width: 256
  }
  transform_param {
    crop_size: 227
    mean_file: "./data/ilsvrc12/imagenet_mean.binaryproto"
    mirror: true
  }
  include: { phase: TRAIN }
}
layer {
  name: "target_domain_labels"
  type: "DummyData"
  top: "target_domain_labels"
  dummy_data_param {
    data_filler {
      type: "constant"
      value: 1
    }
    num: 64
    channels: 1
    height: 1
    width: 1
  }
  include: { phase: TRAIN }
}
layer {
  name: "target_data"
  type: "ImageData"
  top: "data"
  top: "lp_labels"
  image_data_param {
    source: "./data/caltech-office/webcam_10_list.txt"
    batch_size: 1
    shuffle: false
    new_height: 256
    new_width: 256
  }
  transform_param {
    crop_size: 227
    mean_file: "./data/ilsvrc12/imagenet_mean.binaryproto"
    mirror: true
  }
  include: { phase: TEST }
}

layer {
  name: "target_domain_labels"
  type: "DummyData"
  top: "dc_labels"
  dummy_data_param {
    data_filler {
      type: "constant"
      value: 1
    }
    num: 1
    channels: 1
    height: 1
    width: 1
  }
  include: { phase: TEST }
}

layer {
  name: "no_target_label"
  type: "Silence"
  bottom: "target_labels"
  include: { phase:TRAIN }
}
layer {
  name: "no_dc_label_in_test"
  type: "Silence"
  bottom: "dc_labels"
  include: { phase:TEST }
}

# ---------------------------------------------------------- Data concatenation
layer {
  name: "concat_data"
  type: "Concat"
  bottom: "source_data"
  bottom: "target_data"
  top: "data"
  concat_param {
    concat_dim: 0
  }
  include: { phase: TRAIN }
}
layer {
  name: "concat_domain_labels"
  type: "Concat"
  bottom: "source_domain_labels"
  bottom: "target_domain_labels"
  top: "dc_labels"
  concat_param {
    concat_dim: 0
  }
  include: { phase: TRAIN }
}

# ----------------------------------------------------------------------------
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 11
    stride: 4
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu1"
  type: "ReLU"
  bottom: "conv1"
  top: "conv1"
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv1"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "norm1"
  type: "LRN"
  bottom: "pool1"
  top: "norm1"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layer {
  name: "conv2"
  type: "Convolution"
  bottom: "norm1"
  top: "conv2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 2
    kernel_size: 5
    group: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layer {
  name: "relu2"
  type: "ReLU"
  bottom: "conv2"
  top: "conv2"
}
layer {
  name: "pool2"
  type: "Pooling"
  bottom: "conv2"
  top: "pool2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "norm2"
  type: "LRN"
  bottom: "pool2"
  top: "norm2"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layer {
  name: "conv3"
  type: "Convolution"
  bottom: "norm2"
  top: "conv3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 384
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu3"
  type: "ReLU"
  bottom: "conv3"
  top: "conv3"
}
layer {
  name: "conv4"
  type: "Convolution"
  bottom: "conv3"
  top: "conv4"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 384
    pad: 1
    kernel_size: 3
    group: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layer {
  name: "relu4"
  type: "ReLU"
  bottom: "conv4"
  top: "conv4"
}
layer {
  name: "conv5"
  type: "Convolution"
  bottom: "conv4"
  top: "conv5"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    group: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layer {
  name: "relu5"
  type: "ReLU"
  bottom: "conv5"
  top: "conv5"
}
layer {
  name: "pool5"
  type: "Pooling"
  bottom: "conv5"
  top: "pool5"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "fc6"
  type: "InnerProduct"
  bottom: "pool5"
  top: "fc6"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layer {
  name: "relu6"
  type: "ReLU"
  bottom: "fc6"
  top: "fc6"
}
layer {
  name: "drop6"
  type: "Dropout"
  bottom: "fc6"
  top: "fc6"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "fc7"
  type: "InnerProduct"
  bottom: "fc6"
  top: "fc7"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layer {
  name: "relu7"
  type: "ReLU"
  bottom: "fc7"
  top: "fc7"
}
layer {
  name: "drop7"
  type: "Dropout"
  bottom: "fc7"
  top: "fc7"
  dropout_param {
    dropout_ratio: 0.5
  }
}
#layer {
#  name: "bottleneck"
#  type: "InnerProduct"
#  bottom: "fc7"
#  top: "bottleneck"
#  param {
#    lr_mult: 10
#    decay_mult: 1
#  }
#  param {
#    lr_mult: 20
#    decay_mult: 0
#  }
#  inner_product_param {
#    num_output: 256
#    weight_filler {
#      type: "gaussian"
#      std: 0.005
#    }
#    bias_filler {
#      type: "constant"
#      value: 0.1
#    }
#  }
#}
#layer {
#  name: "relu_bottleneck"
#  type: "ReLU"
#  bottom: "bottleneck"
#  top: "bottleneck"
#}
layer {
  name: "lp_fc8"
  type: "InnerProduct"
  bottom: "fc7"
  top: "features_fc8"
  param {
    lr_mult: 10
    decay_mult: 1
  }
  param {
    lr_mult: 20
    decay_mult: 0
  }
  inner_product_param {
    num_output: 256
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "slice_features_fc7"
  type: "Slice"
  bottom: "features_fc8"
  top: "source_features_fc8"
  top: "target_features_fc8"
  slice_param {
    slice_dim: 0
  }
  include: { phase: TRAIN }
}
layer {
  name: "kill_target_features_fc8"
  type: "Silence"
  bottom: "target_features_fc8"
   include: { phase: TRAIN }
}
layer {
  name: "lp_accuracy"
  type: "Accuracy"
  bottom: "features_fc8"
  bottom: "lp_labels"
  top: "lp_accuracy"
  include: { phase: TEST }
}
layer {
  name: "lp_loss"
  type: "SoftmaxWithLoss"
  bottom: "source_features_fc8"
  bottom: "lp_labels"
  top: "lp_loss"
  softmax_param {
    temperature: 1.0
  }
  include: { phase: TRAIN }
}
layer {
  name: "softmax_feature"
  type: "Softmax"
  bottom: "target_features_fc8"
  top: "target_features_fc8s"
  include: { phase: TRAIN }
}
layer {
  name: "entropy_grl"
  type: "GradientScaler"
  bottom: "target_features_fc8s"
  top: "entropy_grl"
  gradient_scaler_param {
    lower_bound: 0.0
    upper_bound: 1.0
    alpha: 10.0
    max_iter: 3000
  }
  include: {phase: TRAIN}
}
layer {
  name: "entropy_loss"
  type: "EntropyLoss"
  bottom: "entropy_grl"
  #bottom: "target_labels"
  top: "entropy_loss"
  loss_weight: -0.1
  entropy_param {
    threshold: 0.001
  }
  include: { phase: TRAIN }
}


layer {
  name: "softmax_feature"
  type: "Softmax"
  bottom: "features_fc8"
  top: "features_fc8s"
  softmax_param{
    temperature: 10.0
  }
  include: { phase: TRAIN }
}

layer {
  name: "grl"
  type: "GradientScaler"
  bottom: "fc7"
  top: "grl"
  gradient_scaler_param {
    lower_bound: 0.0
    upper_bound: 1.0
    alpha: 10.0
    max_iter: 10000
  }
  include: { phase: TRAIN }
}
layer {
  name: "slice_grl"
  type: "Split"
  bottom: "grl"
  top: "grl0"
  top: "grl1"
  top: "grl2"
  top: "grl3"
  top: "grl4"
  top: "grl5"
  top: "grl6"
  top: "grl7"
  top: "grl8"
  top: "grl9"
  top: "grl10"
  top: "grl11"
  top: "grl12"
  top: "grl13"
  top: "grl14"
  top: "grl15"
  top: "grl16"
  top: "grl17"
  top: "grl18"
  top: "grl19"
  top: "grl20"
  top: "grl21"
  top: "grl22"
  top: "grl23"
  top: "grl24"
  top: "grl25"
  top: "grl26"
  top: "grl27"
  top: "grl28"
  top: "grl29"
  top: "grl30"
  top: "grl31"
  top: "grl32"
  top: "grl33"
  top: "grl34"
  top: "grl35"
  top: "grl36"
  top: "grl37"
  top: "grl38"
  top: "grl39"
  top: "grl40"
  top: "grl41"
  top: "grl42"
  top: "grl43"
  top: "grl44"
  top: "grl45"
  top: "grl46"
  top: "grl47"
  top: "grl48"
  top: "grl49"
  top: "grl50"
  top: "grl51"
  top: "grl52"
  top: "grl53"
  top: "grl54"
  top: "grl55"
  top: "grl56"
  top: "grl57"
  top: "grl58"
  top: "grl59"
  top: "grl60"
  top: "grl61"
  top: "grl62"
  top: "grl63"
  top: "grl64"
  top: "grl65"
  top: "grl66"
  top: "grl67"
  top: "grl68"
  top: "grl69"
  top: "grl70"
  top: "grl71"
  top: "grl72"
  top: "grl73"
  top: "grl74"
  top: "grl75"
  top: "grl76"
  top: "grl77"
  top: "grl78"
  top: "grl79"
  top: "grl80"
  top: "grl81"
  top: "grl82"
  top: "grl83"
  top: "grl84"
  top: "grl85"
  top: "grl86"
  top: "grl87"
  top: "grl88"
  top: "grl89"
  top: "grl90"
  top: "grl91"
  top: "grl92"
  top: "grl93"
  top: "grl94"
  top: "grl95"
  top: "grl96"
  top: "grl97"
  top: "grl98"
  top: "grl99"
  top: "grl100"
  top: "grl101"
  top: "grl102"
  top: "grl103"
  top: "grl104"
  top: "grl105"
  top: "grl106"
  top: "grl107"
  top: "grl108"
  top: "grl109"
  top: "grl110"
  top: "grl111"
  top: "grl112"
  top: "grl113"
  top: "grl114"
  top: "grl115"
  top: "grl116"
  top: "grl117"
  top: "grl118"
  top: "grl119"
  top: "grl120"
  top: "grl121"
  top: "grl122"
  top: "grl123"
  top: "grl124"
  top: "grl125"
  top: "grl126"
  top: "grl127"
  top: "grl128"
  top: "grl129"
  top: "grl130"
  top: "grl131"
  top: "grl132"
  top: "grl133"
  top: "grl134"
  top: "grl135"
  top: "grl136"
  top: "grl137"
  top: "grl138"
  top: "grl139"
  top: "grl140"
  top: "grl141"
  top: "grl142"
  top: "grl143"
  top: "grl144"
  top: "grl145"
  top: "grl146"
  top: "grl147"
  top: "grl148"
  top: "grl149"
  top: "grl150"
  top: "grl151"
  top: "grl152"
  top: "grl153"
  top: "grl154"
  top: "grl155"
  top: "grl156"
  top: "grl157"
  top: "grl158"
  top: "grl159"
  top: "grl160"
  top: "grl161"
  top: "grl162"
  top: "grl163"
  top: "grl164"
  top: "grl165"
  top: "grl166"
  top: "grl167"
  top: "grl168"
  top: "grl169"
  top: "grl170"
  top: "grl171"
  top: "grl172"
  top: "grl173"
  top: "grl174"
  top: "grl175"
  top: "grl176"
  top: "grl177"
  top: "grl178"
  top: "grl179"
  top: "grl180"
  top: "grl181"
  top: "grl182"
  top: "grl183"
  top: "grl184"
  top: "grl185"
  top: "grl186"
  top: "grl187"
  top: "grl188"
  top: "grl189"
  top: "grl190"
  top: "grl191"
  top: "grl192"
  top: "grl193"
  top: "grl194"
  top: "grl195"
  top: "grl196"
  top: "grl197"
  top: "grl198"
  top: "grl199"
  top: "grl200"
  top: "grl201"
  top: "grl202"
  top: "grl203"
  top: "grl204"
  top: "grl205"
  top: "grl206"
  top: "grl207"
  top: "grl208"
  top: "grl209"
  top: "grl210"
  top: "grl211"
  top: "grl212"
  top: "grl213"
  top: "grl214"
  top: "grl215"
  top: "grl216"
  top: "grl217"
  top: "grl218"
  top: "grl219"
  top: "grl220"
  top: "grl221"
  top: "grl222"
  top: "grl223"
  top: "grl224"
  top: "grl225"
  top: "grl226"
  top: "grl227"
  top: "grl228"
  top: "grl229"
  top: "grl230"
  top: "grl231"
  top: "grl232"
  top: "grl233"
  top: "grl234"
  top: "grl235"
  top: "grl236"
  top: "grl237"
  top: "grl238"
  top: "grl239"
  top: "grl240"
  top: "grl241"
  top: "grl242"
  top: "grl243"
  top: "grl244"
  top: "grl245"
  top: "grl246"
  top: "grl247"
  top: "grl248"
  top: "grl249"
  top: "grl250"
  top: "grl251"
  top: "grl252"
  top: "grl253"
  top: "grl254"
  top: "grl255"
  #slice_param {
  #  slice_dim: 1
  #}
  include: { phase: TRAIN }
}

layer {
  name: "aggregate_weight"
  type: "AggregateWeight"
  bottom: "features_fc8s"
  top: "weight0"
  top: "weight1"
  top: "weight2"
  top: "weight3"
  top: "weight4"
  top: "weight5"
  top: "weight6"
  top: "weight7"
  top: "weight8"
  top: "weight9"
  top: "weight10"
  top: "weight11"
  top: "weight12"
  top: "weight13"
  top: "weight14"
  top: "weight15"
  top: "weight16"
  top: "weight17"
  top: "weight18"
  top: "weight19"
  top: "weight20"
  top: "weight21"
  top: "weight22"
  top: "weight23"
  top: "weight24"
  top: "weight25"
  top: "weight26"
  top: "weight27"
  top: "weight28"
  top: "weight29"
  top: "weight30"
  top: "weight31"
  top: "weight32"
  top: "weight33"
  top: "weight34"
  top: "weight35"
  top: "weight36"
  top: "weight37"
  top: "weight38"
  top: "weight39"
  top: "weight40"
  top: "weight41"
  top: "weight42"
  top: "weight43"
  top: "weight44"
  top: "weight45"
  top: "weight46"
  top: "weight47"
  top: "weight48"
  top: "weight49"
  top: "weight50"
  top: "weight51"
  top: "weight52"
  top: "weight53"
  top: "weight54"
  top: "weight55"
  top: "weight56"
  top: "weight57"
  top: "weight58"
  top: "weight59"
  top: "weight60"
  top: "weight61"
  top: "weight62"
  top: "weight63"
  top: "weight64"
  top: "weight65"
  top: "weight66"
  top: "weight67"
  top: "weight68"
  top: "weight69"
  top: "weight70"
  top: "weight71"
  top: "weight72"
  top: "weight73"
  top: "weight74"
  top: "weight75"
  top: "weight76"
  top: "weight77"
  top: "weight78"
  top: "weight79"
  top: "weight80"
  top: "weight81"
  top: "weight82"
  top: "weight83"
  top: "weight84"
  top: "weight85"
  top: "weight86"
  top: "weight87"
  top: "weight88"
  top: "weight89"
  top: "weight90"
  top: "weight91"
  top: "weight92"
  top: "weight93"
  top: "weight94"
  top: "weight95"
  top: "weight96"
  top: "weight97"
  top: "weight98"
  top: "weight99"
  top: "weight100"
  top: "weight101"
  top: "weight102"
  top: "weight103"
  top: "weight104"
  top: "weight105"
  top: "weight106"
  top: "weight107"
  top: "weight108"
  top: "weight109"
  top: "weight110"
  top: "weight111"
  top: "weight112"
  top: "weight113"
  top: "weight114"
  top: "weight115"
  top: "weight116"
  top: "weight117"
  top: "weight118"
  top: "weight119"
  top: "weight120"
  top: "weight121"
  top: "weight122"
  top: "weight123"
  top: "weight124"
  top: "weight125"
  top: "weight126"
  top: "weight127"
  top: "weight128"
  top: "weight129"
  top: "weight130"
  top: "weight131"
  top: "weight132"
  top: "weight133"
  top: "weight134"
  top: "weight135"
  top: "weight136"
  top: "weight137"
  top: "weight138"
  top: "weight139"
  top: "weight140"
  top: "weight141"
  top: "weight142"
  top: "weight143"
  top: "weight144"
  top: "weight145"
  top: "weight146"
  top: "weight147"
  top: "weight148"
  top: "weight149"
  top: "weight150"
  top: "weight151"
  top: "weight152"
  top: "weight153"
  top: "weight154"
  top: "weight155"
  top: "weight156"
  top: "weight157"
  top: "weight158"
  top: "weight159"
  top: "weight160"
  top: "weight161"
  top: "weight162"
  top: "weight163"
  top: "weight164"
  top: "weight165"
  top: "weight166"
  top: "weight167"
  top: "weight168"
  top: "weight169"
  top: "weight170"
  top: "weight171"
  top: "weight172"
  top: "weight173"
  top: "weight174"
  top: "weight175"
  top: "weight176"
  top: "weight177"
  top: "weight178"
  top: "weight179"
  top: "weight180"
  top: "weight181"
  top: "weight182"
  top: "weight183"
  top: "weight184"
  top: "weight185"
  top: "weight186"
  top: "weight187"
  top: "weight188"
  top: "weight189"
  top: "weight190"
  top: "weight191"
  top: "weight192"
  top: "weight193"
  top: "weight194"
  top: "weight195"
  top: "weight196"
  top: "weight197"
  top: "weight198"
  top: "weight199"
  top: "weight200"
  top: "weight201"
  top: "weight202"
  top: "weight203"
  top: "weight204"
  top: "weight205"
  top: "weight206"
  top: "weight207"
  top: "weight208"
  top: "weight209"
  top: "weight210"
  top: "weight211"
  top: "weight212"
  top: "weight213"
  top: "weight214"
  top: "weight215"
  top: "weight216"
  top: "weight217"
  top: "weight218"
  top: "weight219"
  top: "weight220"
  top: "weight221"
  top: "weight222"
  top: "weight223"
  top: "weight224"
  top: "weight225"
  top: "weight226"
  top: "weight227"
  top: "weight228"
  top: "weight229"
  top: "weight230"
  top: "weight231"
  top: "weight232"
  top: "weight233"
  top: "weight234"
  top: "weight235"
  top: "weight236"
  top: "weight237"
  top: "weight238"
  top: "weight239"
  top: "weight240"
  top: "weight241"
  top: "weight242"
  top: "weight243"
  top: "weight244"
  top: "weight245"
  top: "weight246"
  top: "weight247"
  top: "weight248"
  top: "weight249"
  top: "weight250"
  top: "weight251"
  top: "weight252"
  top: "weight253"
  top: "weight254"
  top: "weight255"
  include {
    phase: TRAIN
  }
}
# end modified

layer {
  name: "dc_ip10"
  type: "InnerProduct"
  bottom: "grl0"
  top: "dc_ip10"
  param {
    #name: "ip1_1"
    lr_mult: 10
  }
  param {
    #name: "ip1_2"
    lr_mult: 20
  }
  inner_product_param {
    num_output: 256
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
  include: { phase: TRAIN }
}
layer {
  name: "dc_relu10"
  type: "ReLU"
  bottom: "dc_ip10"
  top: "dc_ip10"
  include: { phase: TRAIN }
}
layer {
  name: "dc_drop10"
  type: "Dropout"
  bottom: "dc_ip10"
  top: "dc_ip10"
  dropout_param {
    dropout_ratio: 0.5
  }
  include: { phase: TRAIN }
}
#layer {
#  name: "dc_ip20"
#  type: "InnerProduct"
#  bottom: "dc_ip10"
#  top: "dc_ip20"
#  param {
#    #name: "ip2_1"
#    lr_mult: 10
#  }
#  param {
#    #name: "ip2_2"
#    lr_mult: 20
#  }
#  inner_product_param {
#    num_output: 1024
#    weight_filler {
#      type: "gaussian"
#      std: 0.01
#    }
#    bias_filler {
#      type: "constant"
#    }
#  }
#  include: { phase: TRAIN }
#}
#layer {
#  name: "dc_relu20"
#  type: "ReLU"
#  bottom: "dc_ip20"
#  top: "dc_ip20"
#  include: { phase: TRAIN }
#}
#layer {
#  name: "dc_drop20"
#  type: "Dropout"
#  bottom: "dc_ip20"
#  top: "dc_ip20"
#  dropout_param {
#    dropout_ratio: 0.5
#  }
#  include: { phase: TRAIN }
#}
layer {
  name: "dc_ip30"
  type: "InnerProduct"
  bottom: "dc_ip10"
  top: "dc_ip30"
  param {
    lr_mult: 10
  }
  param {
    lr_mult: 20
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.3
    }
    bias_filler {
      type: "constant"
    }
  }
  include: { phase: TRAIN }
}
layer {
  name: "dc_loss0"
  type: "SigmoidCrossEntropyLoss"
  bottom: "dc_ip30"
  bottom: "dc_labels"
  bottom: "weight0"
  top: "dc_loss0"
  loss_weight: 0.1
  include: { phase: TRAIN }
}
layer {
  name: "dc_ip11"
  type: "InnerProduct"
  bottom: "grl1"
  top: "dc_ip11"
  param {
    #name: "ip1_1"
    lr_mult: 10
  }
  param {
    #name: "ip1_2"
    lr_mult: 20
  }
  inner_product_param {
    num_output: 256
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
  include: { phase: TRAIN }
}
layer {
  name: "dc_relu11"
  type: "ReLU"
  bottom: "dc_ip11"
  top: "dc_ip11"
  include: { phase: TRAIN }
}
layer {
  name: "dc_drop11"
  type: "Dropout"
  bottom: "dc_ip11"
  top: "dc_ip11"
  dropout_param {
    dropout_ratio: 0.5
  }
  include: { phase: TRAIN }
}
#layer {
#  name: "dc_ip21"
#  type: "InnerProduct"
#  bottom: "dc_ip11"
#  top: "dc_ip21"
#  param {
#    #name: "ip2_1"
#    lr_mult: 10
#  }
#  param {
#    #name: "ip2_2"
#    lr_mult: 20
#  }
#  inner_product_param {
#    num_output: 1024
#    weight_filler {
#      type: "gaussian"
#      std: 0.01
#    }
#    bias_filler {
#      type: "constant"
#    }
#  }
#  include: { phase: TRAIN }
#}
#layer {
#  name: "dc_relu21"
#  type: "ReLU"
#  bottom: "dc_ip21"
#  top: "dc_ip21"
#  include: { phase: TRAIN }
#}
#layer {
#  name: "dc_drop21"
#  type: "Dropout"
#  bottom: "dc_ip21"
#  top: "dc_ip21"
#  dropout_param {
#    dropout_ratio: 0.5
#  }
#  include: { phase: TRAIN }
#}
layer {
  name: "dc_ip31"
  type: "InnerProduct"
  bottom: "dc_ip11"
  top: "dc_ip31"
  param {
    lr_mult: 10
  }
  param {
    lr_mult: 20
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.3
    }
    bias_filler {
      type: "constant"
    }
  }
  include: { phase: TRAIN }
}
layer {
  name: "dc_loss1"
  type: "SigmoidCrossEntropyLoss"
  bottom: "dc_ip31"
  bottom: "dc_labels"
  bottom: "weight1"
  top: "dc_loss1"
  loss_weight: 0.1
  include: { phase: TRAIN }
}
layer {
  name: "dc_ip12"
  type: "InnerProduct"
  bottom: "grl2"
  top: "dc_ip12"
  param {
    #name: "ip1_1"
    lr_mult: 10
  }
  param {
    #name: "ip1_2"
    lr_mult: 20
  }
  inner_product_param {
    num_output: 256
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
  include: { phase: TRAIN }
}
layer {
  name: "dc_relu12"
  type: "ReLU"
  bottom: "dc_ip12"
  top: "dc_ip12"
  include: { phase: TRAIN }
}
layer {
  name: "dc_drop12"
  type: "Dropout"
  bottom: "dc_ip12"
  top: "dc_ip12"
  dropout_param {
    dropout_ratio: 0.5
  }
  include: { phase: TRAIN }
}
#layer {
#  name: "dc_ip22"
#  type: "InnerProduct"
#  bottom: "dc_ip12"
#  top: "dc_ip22"
#  param {
#    #name: "ip2_1"
#    lr_mult: 10
#  }
#  param {
#    #name: "ip2_2"
#    lr_mult: 20
#  }
#  inner_product_param {
#    num_output: 1024
#    weight_filler {
#      type: "gaussian"
#      std: 0.01
#    }
#    bias_filler {
#      type: "constant"
#    }
#  }
#  include: { phase: TRAIN }
#}
#layer {
#  name: "dc_relu22"
#  type: "ReLU"
#  bottom: "dc_ip22"
#  top: "dc_ip22"
#  include: { phase: TRAIN }
#}
#layer {
#  name: "dc_drop22"
#  type: "Dropout"
#  bottom: "dc_ip22"
#  top: "dc_ip22"
#  dropout_param {
#    dropout_ratio: 0.5
#  }
#  include: { phase: TRAIN }
#}
layer {
  name: "dc_ip32"
  type: "InnerProduct"
  bottom: "dc_ip12"
  top: "dc_ip32"
  param {
    lr_mult: 10
  }
  param {
    lr_mult: 20
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.3
    }
    bias_filler {
      type: "constant"
    }
  }
  include: { phase: TRAIN }
}
layer {
  name: "dc_loss2"
  type: "SigmoidCrossEntropyLoss"
  bottom: "dc_ip32"
  bottom: "dc_labels"
  bottom: "weight2"
  top: "dc_loss2"
  loss_weight: 0.1
  include: { phase: TRAIN }
}
layer {
  name: "dc_ip13"
  type: "InnerProduct"
  bottom: "grl3"
  top: "dc_ip13"
  param {
    #name: "ip1_1"
    lr_mult: 10
  }
  param {
    #name: "ip1_2"
    lr_mult: 20
  }
  inner_product_param {
    num_output: 256
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
  include: { phase: TRAIN }
}
layer {
  name: "dc_relu13"
  type: "ReLU"
  bottom: "dc_ip13"
  top: "dc_ip13"
  include: { phase: TRAIN }
}
layer {
  name: "dc_drop13"
  type: "Dropout"
  bottom: "dc_ip13"
  top: "dc_ip13"
  dropout_param {
    dropout_ratio: 0.5
  }
  include: { phase: TRAIN }
}
#layer {
#  name: "dc_ip23"
#  type: "InnerProduct"
#  bottom: "dc_ip13"
#  top: "dc_ip23"
#  param {
#    #name: "ip2_1"
#    lr_mult: 10
#  }
#  param {
#    #name: "ip2_2"
#    lr_mult: 20
#  }
#  inner_product_param {
#    num_output: 1024
#    weight_filler {
#      type: "gaussian"
#      std: 0.01
#    }
#    bias_filler {
#      type: "constant"
#    }
#  }
#  include: { phase: TRAIN }
#}
#layer {
#  name: "dc_relu23"
#  type: "ReLU"
#  bottom: "dc_ip23"
#  top: "dc_ip23"
#  include: { phase: TRAIN }
#}
#layer {
#  name: "dc_drop23"
#  type: "Dropout"
#  bottom: "dc_ip23"
#  top: "dc_ip23"
#  dropout_param {
#    dropout_ratio: 0.5
#  }
#  include: { phase: TRAIN }
#}
layer {
  name: "dc_ip33"
  type: "InnerProduct"
  bottom: "dc_ip13"
  top: "dc_ip33"
  param {
    lr_mult: 10
  }
  param {
    lr_mult: 20
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.3
    }
    bias_filler {
      type: "constant"
    }
  }
  include: { phase: TRAIN }
}
layer {
  name: "dc_loss3"
  type: "SigmoidCrossEntropyLoss"
  bottom: "dc_ip33"
  bottom: "dc_labels"
  bottom: "weight3"
  top: "dc_loss3"
  loss_weight: 0.1
  include: { phase: TRAIN }
}
layer {
  name: "dc_ip14"
  type: "InnerProduct"
  bottom: "grl4"
  top: "dc_ip14"
  param {
    #name: "ip1_1"
    lr_mult: 10
  }
  param {
    #name: "ip1_2"
    lr_mult: 20
  }
  inner_product_param {
    num_output: 256
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
  include: { phase: TRAIN }
}
layer {
  name: "dc_relu14"
  type: "ReLU"
  bottom: "dc_ip14"
  top: "dc_ip14"
  include: { phase: TRAIN }
}
layer {
  name: "dc_drop14"
  type: "Dropout"
  bottom: "dc_ip14"
  top: "dc_ip14"
  dropout_param {
    dropout_ratio: 0.5
  }
  include: { phase: TRAIN }
}
#layer {
#  name: "dc_ip24"
#  type: "InnerProduct"
#  bottom: "dc_ip14"
#  top: "dc_ip24"
#  param {
#    #name: "ip2_1"
#    lr_mult: 10
#  }
#  param {
#    #name: "ip2_2"
#    lr_mult: 20
#  }
#  inner_product_param {
#    num_output: 1024
#    weight_filler {
#      type: "gaussian"
#      std: 0.01
#    }
#    bias_filler {
#      type: "constant"
#    }
#  }
#  include: { phase: TRAIN }
#}
#layer {
#  name: "dc_relu24"
#  type: "ReLU"
#  bottom: "dc_ip24"
#  top: "dc_ip24"
#  include: { phase: TRAIN }
#}
#layer {
#  name: "dc_drop24"
#  type: "Dropout"
#  bottom: "dc_ip24"
#  top: "dc_ip24"
#  dropout_param {
#    dropout_ratio: 0.5
#  }
#  include: { phase: TRAIN }
#}
layer {
  name: "dc_ip34"
  type: "InnerProduct"
  bottom: "dc_ip14"
  top: "dc_ip34"
  param {
    lr_mult: 10
  }
  param {
    lr_mult: 20
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.3
    }
    bias_filler {
      type: "constant"
    }
  }
  include: { phase: TRAIN }
}
layer {
  name: "dc_loss4"
  type: "SigmoidCrossEntropyLoss"
  bottom: "dc_ip34"
  bottom: "dc_labels"
  bottom: "weight4"
  top: "dc_loss4"
  loss_weight: 0.1
  include: { phase: TRAIN }
}
layer {
  name: "dc_ip15"
  type: "InnerProduct"
  bottom: "grl5"
  top: "dc_ip15"
  param {
    #name: "ip1_1"
    lr_mult: 10
  }
  param {
    #name: "ip1_2"
    lr_mult: 20
  }
  inner_product_param {
    num_output: 256
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
  include: { phase: TRAIN }
}
layer {
  name: "dc_relu15"
  type: "ReLU"
  bottom: "dc_ip15"
  top: "dc_ip15"
  include: { phase: TRAIN }
}
layer {
  name: "dc_drop15"
  type: "Dropout"
  bottom: "dc_ip15"
  top: "dc_ip15"
  dropout_param {
    dropout_ratio: 0.5
  }
  include: { phase: TRAIN }
}
#layer {
#  name: "dc_ip25"
#  type: "InnerProduct"
#  bottom: "dc_ip15"
#  top: "dc_ip25"
#  param {
#    #name: "ip2_1"
#    lr_mult: 10
#  }
#  param {
#    #name: "ip2_2"
#    lr_mult: 20
#  }
#  inner_product_param {
#    num_output: 1024
#    weight_filler {
#      type: "gaussian"
#      std: 0.01
#    }
#    bias_filler {
#      type: "constant"
#    }
#  }
#  include: { phase: TRAIN }
#}
#layer {
#  name: "dc_relu25"
#  type: "ReLU"
#  bottom: "dc_ip25"
#  top: "dc_ip25"
#  include: { phase: TRAIN }
#}
#layer {
#  name: "dc_drop25"
#  type: "Dropout"
#  bottom: "dc_ip25"
#  top: "dc_ip25"
#  dropout_param {
#    dropout_ratio: 0.5
#  }
#  include: { phase: TRAIN }
#}
layer {
  name: "dc_ip35"
  type: "InnerProduct"
  bottom: "dc_ip15"
  top: "dc_ip35"
  param {
    lr_mult: 10
  }
  param {
    lr_mult: 20
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.3
    }
    bias_filler {
      type: "constant"
    }
  }
  include: { phase: TRAIN }
}
layer {
  name: "dc_loss5"
  type: "SigmoidCrossEntropyLoss"
  bottom: "dc_ip35"
  bottom: "dc_labels"
  bottom: "weight5"
  top: "dc_loss5"
  loss_weight: 0.1
  include: { phase: TRAIN }
}
layer {
  name: "dc_ip16"
  type: "InnerProduct"
  bottom: "grl6"
  top: "dc_ip16"
  param {
    #name: "ip1_1"
    lr_mult: 10
  }
  param {
    #name: "ip1_2"
    lr_mult: 20
  }
  inner_product_param {
    num_output: 256
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
  include: { phase: TRAIN }
}
layer {
  name: "dc_relu16"
  type: "ReLU"
  bottom: "dc_ip16"
  top: "dc_ip16"
  include: { phase: TRAIN }
}
layer {
  name: "dc_drop16"
  type: "Dropout"
  bottom: "dc_ip16"
  top: "dc_ip16"
  dropout_param {
    dropout_ratio: 0.5
  }
  include: { phase: TRAIN }
}
#layer {
#  name: "dc_ip26"
#  type: "InnerProduct"
#  bottom: "dc_ip16"
#  top: "dc_ip26"
#  param {
#    #name: "ip2_1"
#    lr_mult: 10
#  }
#  param {
#    #name: "ip2_2"
#    lr_mult: 20
#  }
#  inner_product_param {
#    num_output: 1024
#    weight_filler {
#      type: "gaussian"
#      std: 0.01
#    }
#    bias_filler {
#      type: "constant"
#    }
#  }
#  include: { phase: TRAIN }
#}
#layer {
#  name: "dc_relu26"
#  type: "ReLU"
#  bottom: "dc_ip26"
#  top: "dc_ip26"
#  include: { phase: TRAIN }
#}
#layer {
#  name: "dc_drop26"
#  type: "Dropout"
#  bottom: "dc_ip26"
#  top: "dc_ip26"
#  dropout_param {
#    dropout_ratio: 0.5
#  }
#  include: { phase: TRAIN }
#}
layer {
  name: "dc_ip36"
  type: "InnerProduct"
  bottom: "dc_ip16"
  top: "dc_ip36"
  param {
    lr_mult: 10
  }
  param {
    lr_mult: 20
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.3
    }
    bias_filler {
      type: "constant"
    }
  }
  include: { phase: TRAIN }
}
layer {
  name: "dc_loss6"
  type: "SigmoidCrossEntropyLoss"
  bottom: "dc_ip36"
  bottom: "dc_labels"
  bottom: "weight6"
  top: "dc_loss6"
  loss_weight: 0.1
  include: { phase: TRAIN }
}
layer {
  name: "dc_ip17"
  type: "InnerProduct"
  bottom: "grl7"
  top: "dc_ip17"
  param {
    #name: "ip1_1"
    lr_mult: 10
  }
  param {
    #name: "ip1_2"
    lr_mult: 20
  }
  inner_product_param {
    num_output: 256
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
  include: { phase: TRAIN }
}
layer {
  name: "dc_relu17"
  type: "ReLU"
  bottom: "dc_ip17"
  top: "dc_ip17"
  include: { phase: TRAIN }
}
layer {
  name: "dc_drop17"
  type: "Dropout"
  bottom: "dc_ip17"
  top: "dc_ip17"
  dropout_param {
    dropout_ratio: 0.5
  }
  include: { phase: TRAIN }
}
#layer {
#  name: "dc_ip27"
#  type: "InnerProduct"
#  bottom: "dc_ip17"
#  top: "dc_ip27"
#  param {
#    #name: "ip2_1"
#    lr_mult: 10
#  }
#  param {
#    #name: "ip2_2"
#    lr_mult: 20
#  }
#  inner_product_param {
#    num_output: 1024
#    weight_filler {
#      type: "gaussian"
#      std: 0.01
#    }
#    bias_filler {
#      type: "constant"
#    }
#  }
#  include: { phase: TRAIN }
#}
#layer {
#  name: "dc_relu27"
#  type: "ReLU"
#  bottom: "dc_ip27"
#  top: "dc_ip27"
#  include: { phase: TRAIN }
#}
#layer {
#  name: "dc_drop27"
#  type: "Dropout"
#  bottom: "dc_ip27"
#  top: "dc_ip27"
#  dropout_param {
#    dropout_ratio: 0.5
#  }
#  include: { phase: TRAIN }
#}
layer {
  name: "dc_ip37"
  type: "InnerProduct"
  bottom: "dc_ip17"
  top: "dc_ip37"
  param {
    lr_mult: 10
  }
  param {
    lr_mult: 20
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.3
    }
    bias_filler {
      type: "constant"
    }
  }
  include: { phase: TRAIN }
}
layer {
  name: "dc_loss7"
  type: "SigmoidCrossEntropyLoss"
  bottom: "dc_ip37"
  bottom: "dc_labels"
  bottom: "weight7"
  top: "dc_loss7"
  loss_weight: 0.1
  include: { phase: TRAIN }
}
layer {
  name: "dc_ip18"
  type: "InnerProduct"
  bottom: "grl8"
  top: "dc_ip18"
  param {
    #name: "ip1_1"
    lr_mult: 10
  }
  param {
    #name: "ip1_2"
    lr_mult: 20
  }
  inner_product_param {
    num_output: 256
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
  include: { phase: TRAIN }
}
layer {
  name: "dc_relu18"
  type: "ReLU"
  bottom: "dc_ip18"
  top: "dc_ip18"
  include: { phase: TRAIN }
}
layer {
  name: "dc_drop18"
  type: "Dropout"
  bottom: "dc_ip18"
  top: "dc_ip18"
  dropout_param {
    dropout_ratio: 0.5
  }
  include: { phase: TRAIN }
}
#layer {
#  name: "dc_ip28"
#  type: "InnerProduct"
#  bottom: "dc_ip18"
#  top: "dc_ip28"
#  param {
#    #name: "ip2_1"
#    lr_mult: 10
#  }
#  param {
#    #name: "ip2_2"
#    lr_mult: 20
#  }
#  inner_product_param {
#    num_output: 1024
#    weight_filler {
#      type: "gaussian"
#      std: 0.01
#    }
#    bias_filler {
#      type: "constant"
#    }
#  }
#  include: { phase: TRAIN }
#}
#layer {
#  name: "dc_relu28"
#  type: "ReLU"
#  bottom: "dc_ip28"
#  top: "dc_ip28"
#  include: { phase: TRAIN }
#}
#layer {
#  name: "dc_drop28"
#  type: "Dropout"
#  bottom: "dc_ip28"
#  top: "dc_ip28"
#  dropout_param {
#    dropout_ratio: 0.5
#  }
#  include: { phase: TRAIN }
#}
layer {
  name: "dc_ip38"
  type: "InnerProduct"
  bottom: "dc_ip18"
  top: "dc_ip38"
  param {
    lr_mult: 10
  }
  param {
    lr_mult: 20
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.3
    }
    bias_filler {
      type: "constant"
    }
  }
  include: { phase: TRAIN }
}
layer {
  name: "dc_loss8"
  type: "SigmoidCrossEntropyLoss"
  bottom: "dc_ip38"
  bottom: "dc_labels"
  bottom: "weight8"
  top: "dc_loss8"
  loss_weight: 0.1
  include: { phase: TRAIN }
}
layer {
  name: "dc_ip19"
  type: "InnerProduct"
  bottom: "grl9"
  top: "dc_ip19"
  param {
    #name: "ip1_1"
    lr_mult: 10
  }
  param {
    #name: "ip1_2"
    lr_mult: 20
  }
  inner_product_param {
    num_output: 256
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
  include: { phase: TRAIN }
}
layer {
  name: "dc_relu19"
  type: "ReLU"
  bottom: "dc_ip19"
  top: "dc_ip19"
  include: { phase: TRAIN }
}
layer {
  name: "dc_drop19"
  type: "Dropout"
  bottom: "dc_ip19"
  top: "dc_ip19"
  dropout_param {
    dropout_ratio: 0.5
  }
  include: { phase: TRAIN }
}
#layer {
#  name: "dc_ip29"
#  type: "InnerProduct"
#  bottom: "dc_ip19"
#  top: "dc_ip29"
#  param {
#    #name: "ip2_1"
#    lr_mult: 10
#  }
#  param {
#    #name: "ip2_2"
#    lr_mult: 20
#  }
#  inner_product_param {
#    num_output: 1024
#    weight_filler {
#      type: "gaussian"
#      std: 0.01
#    }
#    bias_filler {
#      type: "constant"
#    }
#  }
#  include: { phase: TRAIN }
#}
#layer {
#  name: "dc_relu29"
#  type: "ReLU"
#  bottom: "dc_ip29"
#  top: "dc_ip29"
#  include: { phase: TRAIN }
#}
#layer {
#  name: "dc_drop29"
#  type: "Dropout"
#  bottom: "dc_ip29"
#  top: "dc_ip29"
#  dropout_param {
#    dropout_ratio: 0.5
#  }
#  include: { phase: TRAIN }
#}
layer {
  name: "dc_ip39"
  type: "InnerProduct"
  bottom: "dc_ip19"
  top: "dc_ip39"
  param {
    lr_mult: 10
  }
  param {
    lr_mult: 20
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.3
    }
    bias_filler {
      type: "constant"
    }
  }
  include: { phase: TRAIN }
}
layer {
  name: "dc_loss9"
  type: "SigmoidCrossEntropyLoss"
  bottom: "dc_ip39"
  bottom: "dc_labels"
  bottom: "weight9"
  top: "dc_loss9"
  loss_weight: 0.1
  include: { phase: TRAIN }
}
layer {
  name: "dc_ip110"
  type: "InnerProduct"
  bottom: "grl10"
  top: "dc_ip110"
  param {
    #name: "ip1_1"
    lr_mult: 10
  }
  param {
    #name: "ip1_2"
    lr_mult: 20
  }
  inner_product_param {
    num_output: 256
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
  include: { phase: TRAIN }
}
layer {
  name: "dc_relu110"
  type: "ReLU"
  bottom: "dc_ip110"
  top: "dc_ip110"
  include: { phase: TRAIN }
}
layer {
  name: "dc_drop110"
  type: "Dropout"
  bottom: "dc_ip110"
  top: "dc_ip110"
  dropout_param {
    dropout_ratio: 0.5
  }
  include: { phase: TRAIN }
}
#layer {
#  name: "dc_ip210"
#  type: "InnerProduct"
#  bottom: "dc_ip110"
#  top: "dc_ip210"
#  param {
#    #name: "ip2_1"
#    lr_mult: 10
#  }
#  param {
#    #name: "ip2_2"
#    lr_mult: 20
#  }
#  inner_product_param {
#    num_output: 1024
#    weight_filler {
#      type: "gaussian"
#      std: 0.01
#    }
#    bias_filler {
#      type: "constant"
#    }
#  }
#  include: { phase: TRAIN }
#}
#layer {
#  name: "dc_relu210"
#  type: "ReLU"
#  bottom: "dc_ip210"
#  top: "dc_ip210"
#  include: { phase: TRAIN }
#}
#layer {
#  name: "dc_drop210"
#  type: "Dropout"
#  bottom: "dc_ip210"
#  top: "dc_ip210"
#  dropout_param {
#    dropout_ratio: 0.5
#  }
#  include: { phase: TRAIN }
#}
layer {
  name: "dc_ip310"
  type: "InnerProduct"
  bottom: "dc_ip110"
  top: "dc_ip310"
  param {
    lr_mult: 10
  }
  param {
    lr_mult: 20
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.3
    }
    bias_filler {
      type: "constant"
    }
  }
  include: { phase: TRAIN }
}
layer {
  name: "dc_loss10"
  type: "SigmoidCrossEntropyLoss"
  bottom: "dc_ip310"
  bottom: "dc_labels"
  bottom: "weight10"
  top: "dc_loss10"
  loss_weight: 0.1
  include: { phase: TRAIN }
}
layer {
  name: "dc_ip111"
  type: "InnerProduct"
  bottom: "grl11"
  top: "dc_ip111"
  param {
    #name: "ip1_1"
    lr_mult: 10
  }
  param {
    #name: "ip1_2"
    lr_mult: 20
  }
  inner_product_param {
    num_output: 256
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
  include: { phase: TRAIN }
}
layer {
  name: "dc_relu111"
  type: "ReLU"
  bottom: "dc_ip111"
  top: "dc_ip111"
  include: { phase: TRAIN }
}
layer {
  name: "dc_drop111"
  type: "Dropout"
  bottom: "dc_ip111"
  top: "dc_ip111"
  dropout_param {
    dropout_ratio: 0.5
  }
  include: { phase: TRAIN }
}
#layer {
#  name: "dc_ip211"
#  type: "InnerProduct"
#  bottom: "dc_ip111"
#  top: "dc_ip211"
#  param {
#    #name: "ip2_1"
#    lr_mult: 10
#  }
#  param {
#    #name: "ip2_2"
#    lr_mult: 20
#  }
#  inner_product_param {
#    num_output: 1024
#    weight_filler {
#      type: "gaussian"
#      std: 0.01
#    }
#    bias_filler {
#      type: "constant"
#    }
#  }
#  include: { phase: TRAIN }
#}
#layer {
#  name: "dc_relu211"
#  type: "ReLU"
#  bottom: "dc_ip211"
#  top: "dc_ip211"
#  include: { phase: TRAIN }
#}
#layer {
#  name: "dc_drop211"
#  type: "Dropout"
#  bottom: "dc_ip211"
#  top: "dc_ip211"
#  dropout_param {
#    dropout_ratio: 0.5
#  }
#  include: { phase: TRAIN }
#}
layer {
  name: "dc_ip311"
  type: "InnerProduct"
  bottom: "dc_ip111"
  top: "dc_ip311"
  param {
    lr_mult: 10
  }
  param {
    lr_mult: 20
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.3
    }
    bias_filler {
      type: "constant"
    }
  }
  include: { phase: TRAIN }
}
layer {
  name: "dc_loss11"
  type: "SigmoidCrossEntropyLoss"
  bottom: "dc_ip311"
  bottom: "dc_labels"
  bottom: "weight11"
  top: "dc_loss11"
  loss_weight: 0.1
  include: { phase: TRAIN }
}
layer {
  name: "dc_ip112"
  type: "InnerProduct"
  bottom: "grl12"
  top: "dc_ip112"
  param {
    #name: "ip1_1"
    lr_mult: 10
  }
  param {
    #name: "ip1_2"
    lr_mult: 20
  }
  inner_product_param {
    num_output: 256
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
  include: { phase: TRAIN }
}
layer {
  name: "dc_relu112"
  type: "ReLU"
  bottom: "dc_ip112"
  top: "dc_ip112"
  include: { phase: TRAIN }
}
layer {
  name: "dc_drop112"
  type: "Dropout"
  bottom: "dc_ip112"
  top: "dc_ip112"
  dropout_param {
    dropout_ratio: 0.5
  }
  include: { phase: TRAIN }
}
#layer {
#  name: "dc_ip212"
#  type: "InnerProduct"
#  bottom: "dc_ip112"
#  top: "dc_ip212"
#  param {
#    #name: "ip2_1"
#    lr_mult: 10
#  }
#  param {
#    #name: "ip2_2"
#    lr_mult: 20
#  }
#  inner_product_param {
#    num_output: 1024
#    weight_filler {
#      type: "gaussian"
#      std: 0.01
#    }
#    bias_filler {
#      type: "constant"
#    }
#  }
#  include: { phase: TRAIN }
#}
#layer {
#  name: "dc_relu212"
#  type: "ReLU"
#  bottom: "dc_ip212"
#  top: "dc_ip212"
#  include: { phase: TRAIN }
#}
#layer {
#  name: "dc_drop212"
#  type: "Dropout"
#  bottom: "dc_ip212"
#  top: "dc_ip212"
#  dropout_param {
#    dropout_ratio: 0.5
#  }
#  include: { phase: TRAIN }
#}
layer {
  name: "dc_ip312"
  type: "InnerProduct"
  bottom: "dc_ip112"
  top: "dc_ip312"
  param {
    lr_mult: 10
  }
  param {
    lr_mult: 20
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.3
    }
    bias_filler {
      type: "constant"
    }
  }
  include: { phase: TRAIN }
}
layer {
  name: "dc_loss12"
  type: "SigmoidCrossEntropyLoss"
  bottom: "dc_ip312"
  bottom: "dc_labels"
  bottom: "weight12"
  top: "dc_loss12"
  loss_weight: 0.1
  include: { phase: TRAIN }
}
layer {
  name: "dc_ip113"
  type: "InnerProduct"
  bottom: "grl13"
  top: "dc_ip113"
  param {
    #name: "ip1_1"
    lr_mult: 10
  }
  param {
    #name: "ip1_2"
    lr_mult: 20
  }
  inner_product_param {
    num_output: 256
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
  include: { phase: TRAIN }
}
layer {
  name: "dc_relu113"
  type: "ReLU"
  bottom: "dc_ip113"
  top: "dc_ip113"
  include: { phase: TRAIN }
}
layer {
  name: "dc_drop113"
  type: "Dropout"
  bottom: "dc_ip113"
  top: "dc_ip113"
  dropout_param {
    dropout_ratio: 0.5
  }
  include: { phase: TRAIN }
}
#layer {
#  name: "dc_ip213"
#  type: "InnerProduct"
#  bottom: "dc_ip113"
#  top: "dc_ip213"
#  param {
#    #name: "ip2_1"
#    lr_mult: 10
#  }
#  param {
#    #name: "ip2_2"
#    lr_mult: 20
#  }
#  inner_product_param {
#    num_output: 1024
#    weight_filler {
#      type: "gaussian"
#      std: 0.01
#    }
#    bias_filler {
#      type: "constant"
#    }
#  }
#  include: { phase: TRAIN }
#}
#layer {
#  name: "dc_relu213"
#  type: "ReLU"
#  bottom: "dc_ip213"
#  top: "dc_ip213"
#  include: { phase: TRAIN }
#}
#layer {
#  name: "dc_drop213"
#  type: "Dropout"
#  bottom: "dc_ip213"
#  top: "dc_ip213"
#  dropout_param {
#    dropout_ratio: 0.5
#  }
#  include: { phase: TRAIN }
#}
layer {
  name: "dc_ip313"
  type: "InnerProduct"
  bottom: "dc_ip113"
  top: "dc_ip313"
  param {
    lr_mult: 10
  }
  param {
    lr_mult: 20
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.3
    }
    bias_filler {
      type: "constant"
    }
  }
  include: { phase: TRAIN }
}
layer {
  name: "dc_loss13"
  type: "SigmoidCrossEntropyLoss"
  bottom: "dc_ip313"
  bottom: "dc_labels"
  bottom: "weight13"
  top: "dc_loss13"
  loss_weight: 0.1
  include: { phase: TRAIN }
}
layer {
  name: "dc_ip114"
  type: "InnerProduct"
  bottom: "grl14"
  top: "dc_ip114"
  param {
    #name: "ip1_1"
    lr_mult: 10
  }
  param {
    #name: "ip1_2"
    lr_mult: 20
  }
  inner_product_param {
    num_output: 256
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
  include: { phase: TRAIN }
}
layer {
  name: "dc_relu114"
  type: "ReLU"
  bottom: "dc_ip114"
  top: "dc_ip114"
  include: { phase: TRAIN }
}
layer {
  name: "dc_drop114"
  type: "Dropout"
  bottom: "dc_ip114"
  top: "dc_ip114"
  dropout_param {
    dropout_ratio: 0.5
  }
  include: { phase: TRAIN }
}
#layer {
#  name: "dc_ip214"
#  type: "InnerProduct"
#  bottom: "dc_ip114"
#  top: "dc_ip214"
#  param {
#    #name: "ip2_1"
#    lr_mult: 10
#  }
#  param {
#    #name: "ip2_2"
#    lr_mult: 20
#  }
#  inner_product_param {
#    num_output: 1024
#    weight_filler {
#      type: "gaussian"
#      std: 0.01
#    }
#    bias_filler {
#      type: "constant"
#    }
#  }
#  include: { phase: TRAIN }
#}
#layer {
#  name: "dc_relu214"
#  type: "ReLU"
#  bottom: "dc_ip214"
#  top: "dc_ip214"
#  include: { phase: TRAIN }
#}
#layer {
#  name: "dc_drop214"
#  type: "Dropout"
#  bottom: "dc_ip214"
#  top: "dc_ip214"
#  dropout_param {
#    dropout_ratio: 0.5
#  }
#  include: { phase: TRAIN }
#}
layer {
  name: "dc_ip314"
  type: "InnerProduct"
  bottom: "dc_ip114"
  top: "dc_ip314"
  param {
    lr_mult: 10
  }
  param {
    lr_mult: 20
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.3
    }
    bias_filler {
      type: "constant"
    }
  }
  include: { phase: TRAIN }
}
layer {
  name: "dc_loss14"
  type: "SigmoidCrossEntropyLoss"
  bottom: "dc_ip314"
  bottom: "dc_labels"
  bottom: "weight14"
  top: "dc_loss14"
  loss_weight: 0.1
  include: { phase: TRAIN }
}
layer {
  name: "dc_ip115"
  type: "InnerProduct"
  bottom: "grl15"
  top: "dc_ip115"
  param {
    #name: "ip1_1"
    lr_mult: 10
  }
  param {
    #name: "ip1_2"
    lr_mult: 20
  }
  inner_product_param {
    num_output: 256
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
  include: { phase: TRAIN }
}
layer {
  name: "dc_relu115"
  type: "ReLU"
  bottom: "dc_ip115"
  top: "dc_ip115"
  include: { phase: TRAIN }
}
layer {
  name: "dc_drop115"
  type: "Dropout"
  bottom: "dc_ip115"
  top: "dc_ip115"
  dropout_param {
    dropout_ratio: 0.5
  }
  include: { phase: TRAIN }
}
#layer {
#  name: "dc_ip215"
#  type: "InnerProduct"
#  bottom: "dc_ip115"
#  top: "dc_ip215"
#  param {
#    #name: "ip2_1"
#    lr_mult: 10
#  }
#  param {
#    #name: "ip2_2"
#    lr_mult: 20
#  }
#  inner_product_param {
#    num_output: 1024
#    weight_filler {
#      type: "gaussian"
#      std: 0.01
#    }
#    bias_filler {
#      type: "constant"
#    }
#  }
#  include: { phase: TRAIN }
#}
#layer {
#  name: "dc_relu215"
#  type: "ReLU"
#  bottom: "dc_ip215"
#  top: "dc_ip215"
#  include: { phase: TRAIN }
#}
#layer {
#  name: "dc_drop215"
#  type: "Dropout"
#  bottom: "dc_ip215"
#  top: "dc_ip215"
#  dropout_param {
#    dropout_ratio: 0.5
#  }
#  include: { phase: TRAIN }
#}
layer {
  name: "dc_ip315"
  type: "InnerProduct"
  bottom: "dc_ip115"
  top: "dc_ip315"
  param {
    lr_mult: 10
  }
  param {
    lr_mult: 20
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.3
    }
    bias_filler {
      type: "constant"
    }
  }
  include: { phase: TRAIN }
}
layer {
  name: "dc_loss15"
  type: "SigmoidCrossEntropyLoss"
  bottom: "dc_ip315"
  bottom: "dc_labels"
  bottom: "weight15"
  top: "dc_loss15"
  loss_weight: 0.1
  include: { phase: TRAIN }
}
layer {
  name: "dc_ip116"
  type: "InnerProduct"
  bottom: "grl16"
  top: "dc_ip116"
  param {
    #name: "ip1_1"
    lr_mult: 10
  }
  param {
    #name: "ip1_2"
    lr_mult: 20
  }
  inner_product_param {
    num_output: 256
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
  include: { phase: TRAIN }
}
layer {
  name: "dc_relu116"
  type: "ReLU"
  bottom: "dc_ip116"
  top: "dc_ip116"
  include: { phase: TRAIN }
}
layer {
  name: "dc_drop116"
  type: "Dropout"
  bottom: "dc_ip116"
  top: "dc_ip116"
  dropout_param {
    dropout_ratio: 0.5
  }
  include: { phase: TRAIN }
}
#layer {
#  name: "dc_ip216"
#  type: "InnerProduct"
#  bottom: "dc_ip116"
#  top: "dc_ip216"
#  param {
#    #name: "ip2_1"
#    lr_mult: 10
#  }
#  param {
#    #name: "ip2_2"
#    lr_mult: 20
#  }
#  inner_product_param {
#    num_output: 1024
#    weight_filler {
#      type: "gaussian"
#      std: 0.01
#    }
#    bias_filler {
#      type: "constant"
#    }
#  }
#  include: { phase: TRAIN }
#}
#layer {
#  name: "dc_relu216"
#  type: "ReLU"
#  bottom: "dc_ip216"
#  top: "dc_ip216"
#  include: { phase: TRAIN }
#}
#layer {
#  name: "dc_drop216"
#  type: "Dropout"
#  bottom: "dc_ip216"
#  top: "dc_ip216"
#  dropout_param {
#    dropout_ratio: 0.5
#  }
#  include: { phase: TRAIN }
#}
layer {
  name: "dc_ip316"
  type: "InnerProduct"
  bottom: "dc_ip116"
  top: "dc_ip316"
  param {
    lr_mult: 10
  }
  param {
    lr_mult: 20
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.3
    }
    bias_filler {
      type: "constant"
    }
  }
  include: { phase: TRAIN }
}
layer {
  name: "dc_loss16"
  type: "SigmoidCrossEntropyLoss"
  bottom: "dc_ip316"
  bottom: "dc_labels"
  bottom: "weight16"
  top: "dc_loss16"
  loss_weight: 0.1
  include: { phase: TRAIN }
}
layer {
  name: "dc_ip117"
  type: "InnerProduct"
  bottom: "grl17"
